[
  {
    "section_title": "Section 1. Citation",
    "section_content": "1\\. These Rules may be cited as the Accountants (Accounting Corporations, Accounting Firms and Accounting LLPs) Rules.",
    "act_id": null,
    "country": "SINGAPORE",
    "questions": null,
    "cot_pairs": null,
    "additional": "{\"header_id\": \"pr1-\"}"
  },
  {
    "section_title": "Section 2. Form and application for approval",
    "section_content": "2\\. —(1)  The following applications shall be made to the Oversight Committee in such form or manner as may be determined by the Registrar:\n(a)\nany application for approval as an accounting corporation, an accounting firm or an accounting LLP under section 17(1)(a), 18(1)(a) or 18A(1)(a) of the Act, respectively;\n(b)\nany application for approval of the name or proposed name of an accounting corporation, an accounting firm or an accounting LLP under section 17(1)(b), 18(1)(b) or 18A(1)(b) of the Act, respectively;\n(c)\nany application for approval of a change in the name of an accounting corporation, an accounting firm or an accounting LLP under section 19(4) of the Act.\n(2)  The Oversight Committee may, for the purposes of determining whether to approve any application referred to in paragraph (1)(a), require the applicant to submit such particulars or documents as the Oversight Committee deems necessary.",
    "act_id": null,
    "country": "SINGAPORE",
    "questions": null,
    "cot_pairs": null,
    "additional": "{\"header_id\": \"pr2-\"}"
  },
  {
    "section_title": "Section 3. Fees",
    "section_content": "3\\. —(1)  The fees specified in the First Schedule shall be payable  in such manner as the Registrar may determine for the purposes specified therein.\n(2)  The Registrar may for any reason waive, refund or remit, whether wholly or in part, any fee specified in the First Schedule.\n(3)  Despite paragraph (2), no fee paid is refundable in respect of the withdrawal of any application.",
    "act_id": null,
    "country": "SINGAPORE",
    "questions": null,
    "cot_pairs": null,
    "additional": "{\"header_id\": \"pr3-\"}"
  },
  {
    "section_title": "Section 4. Appeals against refusal to approve",
    "section_content": "4\\. An appeal under section 20 of the Act against a decision of the Oversight Committee shall —\n(a)\nbe addressed to the Permanent Secretary to the Ministry of Finance;\n(b)\nset out the grounds of appeal; and\n(c)\nbe accompanied by a copy of the following documents:\n(i)\nthe decision of the Oversight Committee and the reasons therefor;\n(ii)\nthe relevant application referred to in rule 2 and all documents accompanying that application; and\n(iii)\nany other correspondence between the Oversight Committee and the appellant in relation to the decision of the Oversight Committee.",
    "act_id": null,
    "country": "SINGAPORE",
    "questions": null,
    "cot_pairs": null,
    "additional": "{\"header_id\": \"pr4-\"}"
  },
  {
    "section_title": "Section 5. Annual report",
    "section_content": "5\\. The annual report referred to in section 26(3) of the Act shall contain the particulars set out in the Second Schedule.",
    "act_id": null,
    "country": "SINGAPORE",
    "questions": null,
    "cot_pairs": null,
    "additional": "{\"header_id\": \"pr5-\"}"
  },
  {
    "section_title": "Section 6. Constitution",
    "section_content": "6\\. The constitution of an accounting corporation must provide for the matters specified in the Third Schedule.",
    "act_id": null,
    "country": "SINGAPORE",
    "questions": null,
    "cot_pairs": null,
    "additional": "{\"header_id\": \"pr6-\"}"
  },
  {
    "section_title": "Section 7. Notification of transfer of business of accounting firm to accounting corporation",
    "section_content": "7\\. —(1)  Every accounting firm which intends to transfer its business to an accounting corporation shall, no later than 7 days before the transfer, give notice in writing to every client of the accounting firm of the intention to transfer its business.\n(2)  The notice given under paragraph (1) has effect as if it were a notice of resignation within the meaning of section 205AA(1) or 205AB(1) of the Companies Act 1967, as the case may be.",
    "act_id": null,
    "country": "SINGAPORE",
    "questions": null,
    "cot_pairs": null,
    "additional": "{\"header_id\": \"pr7-\"}"
  },
  {
    "section_title": "Section 8. Notification of transfer of business of accounting firm or accounting corporation to accounting LLP",
    "section_content": "8\\. —(1)  Where the business of an accounting firm or accounting corporation is to be transferred to an accounting LLP, notice in writing shall be given to every client of the accounting firm or accounting corporation of the transfer and of the date of the transfer —\n(a)\nby the accounting firm or accounting corporation intending to transfer the business to the accounting LLP at any time before the date of the transfer; or\n(b)\nby the accounting LLP to which the business of the accounting firm or accounting corporation is transferred no later than 7 days after the transfer.\n(2)  The notice given under paragraph (1) shall state that, with effect from the date of the transfer —\n(a)\nthe accounting LLP replaces the accounting firm or accounting corporation, as the case may be, in the provision of public accountancy services to the client;\n(b)\nany document held by the accounting firm or accounting corporation, as the case may be, for or on behalf of the client is transferred to the accounting LLP to be held for or on behalf of the client; and\n(c)\nany money or funds held by the accounting firm or accounting corporation, as the case may be, for or on account of the client is transferred to the accounting LLP to be held for or on account of the client.",
    "act_id": null,
    "country": "SINGAPORE",
    "questions": null,
    "cot_pairs": null,
    "additional": "{\"header_id\": \"pr8-\"}"
  }
]
