{
  "chunk-9ddc6e9f3f840fb9e2a0998e5ee27306": {
    "tokens": 414,
    "content": "Banking Act\n(Chapter 19)\nBanking\n(Exemption from Section 4A (1) and (2)) Notification 2006\nIn exercise of the powers conferred by section 4A(8) of the Banking Act, the Monetary Authority of Singapore hereby makes the following Notification:\nCitation and commencement\n1.  This Notification may be cited as the Banking (Exemption from Section 4A (1) and (2)) Notification 2006 and shall come into operation on 14th July 2006.\nExemption\n2.—(1)  The Authority hereby exempts —\n(a)\tING Bank (Switzerland) Limited from section 4A(1) of the Act in respect of any deposit accepted in Singapore on its behalf by ING Asia Private Bank Limited from any accredited investor in Singapore, in connection with the provision of private banking services in Singapore by ING Asia Private Bank Limited on behalf of ING Bank (Switzerland) Limited; and\n(b)\tING Asia Private Bank Limited from section 4A(2) of the Act in respect of —\n(i)\tany offer or invitation to make any deposit, or to enter or offer to enter into any agreement to make any deposit, with ING Bank (Switzerland) Limited; or\n(ii)\tany advertisement containing such offer or invitation,\nmade or issued to any accredited investor in Singapore in connection with the provision of private banking services in Singapore by ING Asia Private Bank Limited on behalf of ING Bank (Switzerland) Limited.\n(2)  The exemptions under sub-paragraph (1)(a) and (b) are subject to such conditions as may be specified in letters issued by the Authority from time to time to the exempted persons.\n(3)  In this paragraph, “accredited investor” has the same meaning as in regulation 2 of the Banking Regulations (Rg 5).\nMade this 30th day of June 2006.\nHENG SWEE KEAT\nManaging Director,\nMonetary Authority of Singapore.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-9ddc6e9f3f840fb9e2a0998e5ee27306",
    "file_path": "unknown_source"
  },
  "chunk-a9b8391a997910fe8afb7f4afef512b8": {
    "tokens": 198,
    "content": "Banking Act 1970\nBanking\n(Exemption from section 4A(2))\n(Revocation) Regulations 2025\nIn exercise of the powers conferred by section 76A(4) of the Banking Act 1970, the Monetary Authority of Singapore makes the following Regulations:\nCitation and commencement\n1.  These Regulations are the Banking (Exemption from section 4A(2)) (Revocation) Regulations 2025 and come into operation on 23 April 2025.\nRevocation\n2.  Revoke the Banking (Exemption from section 4A(2)) Regulations 2006 (G.N. No. S 539/2006).\nMade on 17 April 2025.\nCHIA DER JIUN\nManaging Director,\nMonetary Authority of Singapore.\n[FSG BK 0241; FSG BK 0279; AG/LEGIS/SL/19/2025/1]",
    "chunk_order_index": 0,
    "full_doc_id": "doc-a9b8391a997910fe8afb7f4afef512b8",
    "file_path": "unknown_source"
  },
  "chunk-22b6cea34ba021b52edbc6c4275f23f8": {
    "tokens": 208,
    "content": "Infrastructure Protection Act 2017\nInfrastructure Protection\n(Protected Areas) (No. 6)\nOrder 2025\nIn exercise of the powers conferred by section 8(1) of the Infrastructure Protection Act 2017, the Minister for Home Affairs makes the following Order:\nCitation and commencement\n1.  This Order is the Infrastructure Protection (Protected Areas) (No. 6) Order 2025 and comes into operation on 9 April 2025.\nPremises declared to be protected area\n2.  The premises described in the second column of the Schedule are declared to be a protected area for the purposes of the Act, and the person specified in the first column of that Schedule is designated as the authority of the protected area.\nMade on 27 March 2025.\nPANG KIN KEONG\nPermanent Secretary,\nMinistry of Home Affairs,\nSingapore.\n[SPF/CPS/C/09/12/32; AG/LEGIS/SL/137B/2025/2]",
    "chunk_order_index": 0,
    "full_doc_id": "doc-22b6cea34ba021b52edbc6c4275f23f8",
    "file_path": "unknown_source"
  },
  "chunk-bbc32e97018013d26be9b5915de42211": {
    "tokens": 208,
    "content": "Infrastructure Protection Act 2017\nInfrastructure Protection\n(Protected Places) (No. 8)\nOrder 2025\nIn exercise of the powers conferred by section 14(1) of the Infrastructure Protection Act 2017, the Minister for Home Affairs makes the following Order:\nCitation and commencement\n1.  This Order is the Infrastructure Protection (Protected Places) (No. 8) Order 2025 and comes into operation on 9 April 2025.\nPremises declared to be protected places\n2.  The premises described in the second column of the Schedule are declared to be protected places for the purposes of the Act, and the person specified in the first column of that Schedule is designated as the authority of the corresponding protected place.\nMade on 27 March 2025.\nPANG KIN KEONG\nPermanent Secretary,\nMinistry of Home Affairs,\nSingapore.\n[SPF/CPS/C/09/12/33; AG/LEGIS/SL/137B/2025/1]",
    "chunk_order_index": 0,
    "full_doc_id": "doc-bbc32e97018013d26be9b5915de42211",
    "file_path": "unknown_source"
  },
  "chunk-35825fc4a9f4368a0dcb9334e0033776": {
    "tokens": 1200,
    "content": "Infrastructure Protection\nAct 2017\n2020 REVISED EDITION\nThis revised edition incorporates all amendments up to and including 1 December 2021 and comes into operation on 31 December 2021\nAn Act to provide for the protection of certain areas, places and other premises in Singapore against security risks.\n[18 December 2018]\nPART 1\nPRELIMINARY\nShort title\n1.  This Act is the Infrastructure Protection Act 2017.\nInterpretation\n2.—(1)  In this Act, unless the context otherwise requires —\n“act of terrorism” means any of the following:\n(a)\ta terrorist bombing offence within the meaning of the Terrorism (Suppression of Bombings) Act 2007;\n(b)\ta terrorist act within the meaning of the Terrorism (Suppression of Financing) Act 2002;\n“Appeal Advisory Board” means the Appeal Advisory Board established under section 63;\n“approved security plan”, for a special development or a special infrastructure, means any security plan that is approved by the Commissioner and is in force for that special development or that special infrastructure under this Act;\n“authorised officer”, for a protected area or a protected place, means —\n(a)\ta police officer;\n(b)\tan officer or a senior military expert of the Singapore Armed Forces;\n(c)\ta soldier of the Singapore Armed Forces who is deployed to guard that protected area or that protected place;\n(d)\tan officer or a member of a visiting force lawfully present in Singapore who is deployed to guard that protected area or that protected place under the terms of any treaty, agreement or arrangement to which the Government is a party;\n(e)\ta prison officer (as defined in section 2 of the Prisons Act 1933) who is deployed to guard that protected area or that protected place;\n(f)\tan immigration officer (as defined in section 2 of the Immigration Act 1959) who is deployed to guard that protected area or that protected place;\n(g)\tan auxiliary police officer who is deployed to guard that protected area or that protected place; or\n(h)\ta security officer who is authorised by the Commissioner of Police under section 6(1) and is deployed to guard that protected area or that protected place;\n“authority” —\n(a)\tfor a protected area, means the person who is designated as the authority of the protected area in the protected area order for the protected area; or\n(b)\tfor a protected place, means the person who is designated as the authority of the protected place in the protected place order for the protected place;\n“auxiliary police officer” has the meaning given by section 2(1) of the Police Force Act 2004;\n“building” means any permanent or temporary building or structure;\n“Commissioner” means the Commissioner of Infrastructure Protection appointed under section 5, and (subject to any condition or restriction imposed under that section) includes a Deputy Commissioner of Infrastructure Protection or an Assistant Commissioner of Infrastructure Protection appointed under that section;\n“Commissioner of Police” means the Commissioner of Police appointed under section 6(1) of the Police Force Act 2004;\n“critical asset”, for any premises, means any facility, system or equipment which, if damaged or destroyed, may have a debilitating impact on the functioning of the premises;\n“document” has the meaning given by section 29 of the Penal Code 1871;\n“major renovation”, for any premises, means —\n(a)\tin the case of any part of a building that contains a critical asset, or is a public place or is otherwise accessible to vehicles or vessels, any alteration, extension, repair, dismantling or demolition works carried out to the structure or glazing of that part;\n(b)\tany installation or relocation of a critical asset in the premises; or\n(c)\tany alteration, extension, dismantling or demolition works affecting the perimeter of the premises;\n“member of a state force” means any of the following persons:\n(a)\ta police officer;\n(b)\tan auxiliary police officer;\n(c)\tan officer, a senior military expert or a soldier of the Singapore Armed Forces;\n(d)\ta member of the Singapore Civil Defence Force, as defined in section 2 of the Civil Defence Act 1986;\n(e)\tany public officer, or any officer in a class of public officers, authorised in writing by the Minister for the purposes of Part 6;\n“new development” means any new development that is proposed to be or being constructed;\n“occupier”, for any premises, means the person in occupation or having the charge, management or control of the premises;\n“officer”, “senior military expert”, “serviceman” and “soldier”, in relation to the Singapore Armed Forces, have the meanings given by section 2(1) of the Singapore Armed Forces Act 1972;\n“owner”  —\n(a)\tfor the common property of a building erected on land comprised in a strata title plan, means the management corporation having control of the building;\n(b)\tfor the limited common property of a building erected on land comprised in a strata title plan, means the subsidiary management corporation having control of that limited common property;\n(c)\tfor the common property of a building comprising flats sold under Part 4 of the Housing and Development Act 1959, means —\n(i)\tin the case where a Town Council (established under the Town Councils Act 1988) is liable for the management of that common property, the Town Council; and\n(ii)\tin any other case, the Housing and Development Board (established under the Housing and Development Act 1959); and\n(d)\tfor any other premises, includes any mortgagee in possession and any person for the time being receiving the rent for the premises whether on the person’s own account or as agent or trustee or as receiver, or who would receive the same if the premises were let to a",
    "chunk_order_index": 0,
    "full_doc_id": "doc-ff9816b91f97add26f6d44618d5c0194",
    "file_path": "unknown_source"
  },
  "chunk-d74666a2cc8cd917fb2284173086c763": {
    "tokens": 1200,
    "content": "8) is liable for the management of that common property, the Town Council; and\n(ii)\tin any other case, the Housing and Development Board (established under the Housing and Development Act 1959); and\n(d)\tfor any other premises, includes any mortgagee in possession and any person for the time being receiving the rent for the premises whether on the person’s own account or as agent or trustee or as receiver, or who would receive the same if the premises were let to a tenant, and any person whose name is entered in the Valuation List prepared under section 10 of the Property Tax Act 1960 as the owner of the premises;\n“personal property”, in relation to a person, means any thing worn or carried by the person or apparently in the immediate control of the person;\n“police officer” has the meaning given by section 2(1) of the Police Force Act 2004;\n“premises” includes —\n(a)\tany building;\n(b)\tany land, whether built on or not;\n(c)\tany body of water; and\n(d)\tany area or place, whether or not enclosed, and whether underground or underwater;\n“protected area” means any premises in Singapore declared in a protected area order to be a protected area;\n“protected area order” means an order made under section 8 declaring any premises to be a protected area, and includes the order as amended under section 11;\n“protected infrastructure” means —\n(a)\ta protected area;\n(b)\ta protected place;\n(c)\ta special development;\n(d)\ta special infrastructure; or\n(e)\tany premises in respect of which a security directive under section 55 or a Minister’s order under section 58 is issued;\n“protected place” means any premises in Singapore declared in a protected place order to be a protected place;\n“protected place order” means an order made under section 14 declaring any premises to be a protected place, and includes the order as amended under section 17;\n“public place” means any premises to which the public, or a section of the public, ordinarily has access, whether on payment, by invitation, as of right, or by express or implied permission;\n“repealed Act” means the Protected Areas and Protected Places Act (Cap. 256, 2013 Revised Edition) repealed by this Act;\n“responsible person”, for a special development or a special infrastructure, has the meaning given to that expression in section 32;\n“security agency” means any person licensed as a security agency under the Private Security Industry Act 2007;\n“security measure” includes any installation, equipment, works, action or procedure manufactured, used or designed to be used for the purposes of reducing a security risk;\n“security officer” has the meaning given by section 13 of the Private Security Industry Act 2007;\n“Singapore Armed Forces” has the meaning given by section 2(1) of the Singapore Armed Forces Act 1972;\n“special development” means a new development designated as a special development under section 34;\n“special infrastructure” means —\n(a)\ta special infrastructure described in section 40; or\n(b)\tany premises designated as a special infrastructure under section 41;\n“specified surrounding area”, for a protected area or a protected place, means any surrounding area of that protected area or that protected place that is specified in the protected area order (for that protected area) or the protected place order (for that protected place) for the purposes of sections 27 and 28;\n“specified works”  —\n(a)\tfor a special development, means any works for or affecting the foundation, retaining structure, substructure or superstructure of any building to be or being constructed under the special development; or\n(b)\tfor a special infrastructure, means —\n(i)\tany extension of the special infrastructure;\n(ii)\tany major renovation to the special infrastructure; or\n(iii)\tany other type of works prescribed by the Minister;\n“temporary occupation permit”, for a special development or a special infrastructure, means a temporary occupation permit granted or a certificate of statutory completion issued under the Building Control Act 1989 for that special development or that special infrastructure;\n“vehicle” means any vehicle whether mechanically propelled or otherwise;\n“vessel” includes any ship, boat, craft (including submersible craft), floating platform or air‑cushioned vehicle, whether mechanically propelled or otherwise, that is used to navigate any body of water;\n“visiting force” has the meaning given by section 2(1) of the Visiting Forces Act 1960.\n(2)  In this Act, unless the context otherwise requires, a reference to any premises, building or protected infrastructure includes a reference to a part of the premises, building or protected infrastructure.\nApplication of this Act\n3.—(1)  Except as provided in subsection (2), this Act binds the Government and applies to any premises owned or occupied by the Government.\n(2)  Nothing in this Act renders the Government liable to prosecution for an offence.\n(3)  To avoid doubt, no person is immune from prosecution for any offence under this Act by reason only that the person is an employee of or is engaged to provide services to the Government.\nOperation of other written laws\n4.—(1)  Nothing in this Act affects the operation of, or derogates from, the following written laws:\n(a)\tthe Air Navigation Act 1966;\n(b)\tthe Building Control Act 1989;\n(c)\tthe Civil Defence Shelter Act 1997;\n(d)\tthe Criminal Procedure Code 2010;\n(e)\tthe Fire Safety Act 1993;\n(f)\tthe Liquor Control (Supply and Consumption) Act 2015;\n(g)\tthe Planning Act 1998;\n(h)\tthe Police Force Act 2004;\n(i)\tthe Private Security Industry Act 2007",
    "chunk_order_index": 1,
    "full_doc_id": "doc-ff9816b91f97add26f6d44618d5c0194",
    "file_path": "unknown_source"
  },
  "chunk-51e71061fe748ddb72f55666d7c7c24c": {
    "tokens": 223,
    "content": "following written laws:\n(a)\tthe Air Navigation Act 1966;\n(b)\tthe Building Control Act 1989;\n(c)\tthe Civil Defence Shelter Act 1997;\n(d)\tthe Criminal Procedure Code 2010;\n(e)\tthe Fire Safety Act 1993;\n(f)\tthe Liquor Control (Supply and Consumption) Act 2015;\n(g)\tthe Planning Act 1998;\n(h)\tthe Police Force Act 2004;\n(i)\tthe Private Security Industry Act 2007;\n(j)\tthe Public Order Act 2009;\n(k)\tthe Singapore Armed Forces Act 1972;\n(l)\tany other prescribed written law (or any part of that written law as prescribed).\n(2)  To avoid doubt, nothing in this Act affects —\n(a)\tthe exercise by a police officer or an auxiliary police officer of any power under the Criminal Procedure Code 2010, the Public Order Act 2009 or any other written law; or\n(b)\tthe exercise by a serviceman of any power in accordance with section 201D of the Singapore Armed Forces Act 1972.",
    "chunk_order_index": 2,
    "full_doc_id": "doc-ff9816b91f97add26f6d44618d5c0194",
    "file_path": "unknown_source"
  }
}