{
  "doc-88c3648eb8fb90f9c4833c25d973ce41": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Subsidiary Legislation Name: ACCOUNTANTS\n(PRESCRIBED DOCUMENTS AND\nINFORMATION) RULES 2024\n        Section Title: Section 1. Citation\n        Section Content: 1\\. These Rules may be cited as the Accountants (Accounting Corporations, Accounting Firms and Accounting LLPs) Rules.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Subsidiary Legislation Name: ACCOUNTANTS\n(PRESCRIBED DOCUMENT...",
    "content_length": 316,
    "created_at": "2025-03-30T13:36:05.174889",
    "updated_at": "2025-03-30T13:36:21.659087",
    "file_path": "unknown_source"
  },
  "doc-92ed4e900460b29f354c3880e70a44e6": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Subsidiary Legislation Name: ACCOUNTANTS\n(PRESCRIBED DOCUMENTS AND\nINFORMATION) RULES 2024\n        Section Title: Section 2. Form and application for approval\n        Section Content: 2\\. —(1)  The following applications shall be made to the Oversight Committee in such form or manner as may be determined by the Registrar:\n(a)\nany application for approval as an accounting corporation, an accounting firm or an accounting LLP under section 17(1)(a), 18(1)(a) or 18A(1)(a) of the Act, respectively;\n(b)\nany application for approval of the name or proposed name of an accounting corporation, an accounting firm or an accounting LLP under section 17(1)(b), 18(1)(b) or 18A(1)(b) of the Act, respectively;\n(c)\nany application for approval of a change in the name of an accounting corporation, an accounting firm or an accounting LLP under section 19(4) of the Act.\n(2)  The Oversight Committee may, for the purposes of determining whether to approve any application referred to in paragraph (1)(a), require the applicant to submit such particulars or documents as the Oversight Committee deems necessary.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Subsidiary Legislation Name: ACCOUNTANTS\n(PRESCRIBED DOCUMENT...",
    "content_length": 1140,
    "created_at": "2025-03-30T13:36:21.672906",
    "updated_at": "2025-03-30T13:36:41.701211",
    "file_path": "unknown_source"
  },
  "doc-6c5bcbeedcca51d14b105d59270ac5b9": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Subsidiary Legislation Name: ACCOUNTANTS\n(PRESCRIBED DOCUMENTS AND\nINFORMATION) RULES 2024\n        Section Title: Section 3. Fees\n        Section Content: 3\\. —(1)  The fees specified in the First Schedule shall be payable  in such manner as the Registrar may determine for the purposes specified therein.\n(2)  The Registrar may for any reason waive, refund or remit, whether wholly or in part, any fee specified in the First Schedule.\n(3)  Despite paragraph (2), no fee paid is refundable in respect of the withdrawal of any application.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Subsidiary Legislation Name: ACCOUNTANTS\n(PRESCRIBED DOCUMENT...",
    "content_length": 577,
    "created_at": "2025-03-30T13:36:41.709556",
    "updated_at": "2025-03-30T13:36:55.655778",
    "file_path": "unknown_source"
  },
  "doc-4bf77e5e17d23233af2d7a8a0711b786": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Subsidiary Legislation Name: ACCOUNTANTS\n(PRESCRIBED DOCUMENTS AND\nINFORMATION) RULES 2024\n        Section Title: Section 4. Appeals against refusal to approve\n        Section Content: 4\\. An appeal under section 20 of the Act against a decision of the Oversight Committee shall —\n(a)\nbe addressed to the Permanent Secretary to the Ministry of Finance;\n(b)\nset out the grounds of appeal; and\n(c)\nbe accompanied by a copy of the following documents:\n(i)\nthe decision of the Oversight Committee and the reasons therefor;\n(ii)\nthe relevant application referred to in rule 2 and all documents accompanying that application; and\n(iii)\nany other correspondence between the Oversight Committee and the appellant in relation to the decision of the Oversight Committee.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Subsidiary Legislation Name: ACCOUNTANTS\n(PRESCRIBED DOCUMENT...",
    "content_length": 799,
    "created_at": "2025-03-30T13:36:55.666891",
    "updated_at": "2025-03-30T13:37:14.027023",
    "file_path": "unknown_source"
  },
  "doc-f39b69989660a262daced9249b85f173": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Subsidiary Legislation Name: ACCOUNTANTS\n(PRESCRIBED DOCUMENTS AND\nINFORMATION) RULES 2024\n        Section Title: Section 5. Annual report\n        Section Content: 5\\. The annual report referred to in section 26(3) of the Act shall contain the particulars set out in the Second Schedule.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Subsidiary Legislation Name: ACCOUNTANTS\n(PRESCRIBED DOCUMENT...",
    "content_length": 326,
    "created_at": "2025-03-30T13:37:14.041708",
    "updated_at": "2025-03-30T13:37:22.809110",
    "file_path": "unknown_source"
  },
  "doc-8dfc01feee2888d4e5e302ddee3561e7": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Subsidiary Legislation Name: ACCOUNTANTS\n(PRESCRIBED DOCUMENTS AND\nINFORMATION) RULES 2024\n        Section Title: Section 6. Constitution\n        Section Content: 6\\. The constitution of an accounting corporation must provide for the matters specified in the Third Schedule.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Subsidiary Legislation Name: ACCOUNTANTS\n(PRESCRIBED DOCUMENT...",
    "content_length": 313,
    "created_at": "2025-03-30T13:37:22.827503",
    "updated_at": "2025-03-30T13:37:32.403300",
    "file_path": "unknown_source"
  },
  "doc-a0101fdfe735756ed4ebd19def4c4860": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Subsidiary Legislation Name: ACCOUNTANTS\n(PRESCRIBED DOCUMENTS AND\nINFORMATION) RULES 2024\n        Section Title: Section 7. Notification of transfer of business of accounting firm to accounting corporation\n        Section Content: 7\\. —(1)  Every accounting firm which intends to transfer its business to an accounting corporation shall, no later than 7 days before the transfer, give notice in writing to every client of the accounting firm of the intention to transfer its business.\n(2)  The notice given under paragraph (1) has effect as if it were a notice of resignation within the meaning of section 205AA(1) or 205AB(1) of the Companies Act 1967, as the case may be.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Subsidiary Legislation Name: ACCOUNTANTS\n(PRESCRIBED DOCUMENT...",
    "content_length": 713,
    "created_at": "2025-03-30T13:37:32.421757",
    "updated_at": "2025-03-30T13:37:46.098601",
    "file_path": "unknown_source"
  },
  "doc-46222ac9a37b4b22b1406b7ac32458d0": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Subsidiary Legislation Name: ACCOUNTANTS\n(PRESCRIBED DOCUMENTS AND\nINFORMATION) RULES 2024\n        Section Title: Section 8. Notification of transfer of business of accounting firm or accounting corporation to accounting LLP\n        Section Content: 8\\. —(1)  Where the business of an accounting firm or accounting corporation is to be transferred to an accounting LLP, notice in writing shall be given to every client of the accounting firm or accounting corporation of the transfer and of the date of the transfer —\n(a)\nby the accounting firm or accounting corporation intending to transfer the business to the accounting LLP at any time before the date of the transfer; or\n(b)\nby the accounting LLP to which the business of the accounting firm or accounting corporation is transferred no later than 7 days after the transfer.\n(2)  The notice given under paragraph (1) shall state that, with effect from the date of the transfer —\n(a)\nthe accounting LLP replaces the accounting firm or accounting corporation, as the case may be, in the provision of public accountancy services to the client;\n(b)\nany document held by the accounting firm or accounting corporation, as the case may be, for or on behalf of the client is transferred to the accounting LLP to be held for or on behalf of the client; and\n(c)\nany money or funds held by the accounting firm or accounting corporation, as the case may be, for or on account of the client is transferred to the accounting LLP to be held for or on account of the client.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Subsidiary Legislation Name: ACCOUNTANTS\n(PRESCRIBED DOCUMENT...",
    "content_length": 1551,
    "created_at": "2025-03-30T13:37:46.118564",
    "updated_at": "2025-03-30T13:38:06.380253",
    "file_path": "unknown_source"
  },
  "doc-50d4fa5d1e9946c4a6a4d1e659c981d4": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 1. Short title\n        Section Content: 1\\. This Act is the Accountants Act 2004.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 1. Short title\n        Section Content...",
    "content_length": 143,
    "created_at": "2025-03-31T07:23:36.470059",
    "updated_at": "2025-03-31T07:23:43.820171",
    "file_path": "unknown_source"
  },
  "doc-f63574990f0cba2e5760ba190d8574a5": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 10. Qualifications for registration\n        Section Content: 10\\. —(1)  Any individual who —\n(a)\nhas attained 21 years of age; and\n(b)\nsatisfies the prescribed requirements relating to —\n(i)\nqualifications;\n(ii)\npractical experience; and\n(iii)\nmembership in any professional accountancy body or organisation,\nis entitled, on payment of the prescribed fee, to be registered as a public accountant under this Part.\n(2)  The Authority may, after consultation with the Oversight Committee and subject to such conditions as it thinks fit, exempt any individual from any of the prescribed requirements referred to in subsection (1)(b).",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 10. Qualifications for registration\n  ...",
    "content_length": 691,
    "created_at": "2025-03-31T07:23:43.852675",
    "updated_at": "2025-03-31T07:23:57.393450",
    "file_path": "unknown_source"
  },
  "doc-4aa913a66342e627626393e4759fd39c": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 11. Application for registration\n        Section Content: 11\\. —(1)  Any individual who desires to be registered as a public accountant under this Part may make an application to the Oversight Committee in such form or manner as the Oversight Committee may require.\n(2)  An application for registration under subsection (1) on or after the date of commencement of section 15 of the ACRA (Registry and Regulatory Enhancements) Act 2024 must contain the following particulars of the applicant:\n(a)\nfull name;\n(b)\nidentification;\n(c)\nnationality;\n(d)\nresidential address and contact address.\n(3)  An application under subsection (1) must be accompanied by —\n(a)\nthe prescribed fee; and\n(b)\na declaration by the applicant verifying any information contained in or relating to the application.\n(4)  The Oversight Committee may require an applicant for registration to undergo such interviews as the Oversight Committee may determine.\n(5)  The Oversight Committee may refuse to register any applicant who —\n(a)\nin the opinion of the Oversight Committee —\n(i)\nis not of good reputation or character;\n(ii)\nis engaged in any business or occupation that is inconsistent with the integrity of a public accountant; or\n(iii)\nis otherwise unfit to practise as a public accountant; or\n(b)\nhas had his or her registration, licence or approval to practise as a public accountant in any other country withdrawn, suspended, cancelled or revoked.\n(6)  Where the Oversight Committee refuses to register an applicant, it must by written notice inform the applicant of its refusal.\n(7)  Any person who is aggrieved by any refusal of the Oversight Committee under subsection (5) may, within 30 days of the notice given under subsection (6), appeal to the Minister whose decision is final.\n(8)  In the case of an applicant who applies for registration before 3 January 2016 and is registered as a public accountant after 3 January 2016, the address stated in his or her application to the Oversight Committee is treated as his or her residential address in the Register of Public Accountants, until a notification of any change to his or her residential address is received under section 14(1).\n(9)  In the case of a public accountant registered before 3 January 2016, the address as recorded in the Register of Public Accountants is treated as his or her residential address in that Register, until a notification of any change to the public accountant’s residential address is received by the Registrar under section 14(1).",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 11. Application for registration\n     ...",
    "content_length": 2562,
    "created_at": "2025-03-31T07:23:57.427680",
    "updated_at": "2025-03-31T07:24:18.487214",
    "file_path": "unknown_source"
  },
  "doc-e36e7747573d59d43bcaa718c57e3de2": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 12. Certificate of registration and record in Register of Public Accountants\n        Section Content: 12\\. —(1)  Upon an individual being registered as a public accountant under this Part, the Registrar must —\n(a)\nissue to the individual a certificate of registration; and\n(b)\nrecord his or her name and relevant particulars in the Register of Public Accountants.\n(2)  A certificate of registration must be issued in such form or manner as the Oversight Committee may determine.\n(3)  Subject to the provisions of this Act, every such certificate of registration is in force from the date of its issue or renewal to 31 December of the year in respect of which the certificate is issued or renewed.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 12. Certificate of registration and re...",
    "content_length": 758,
    "created_at": "2025-03-31T07:24:18.522562",
    "updated_at": "2025-03-31T07:24:30.047432",
    "file_path": "unknown_source"
  },
  "doc-0f95176dbffacff65e716c92ff4cf3d0": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 12A. Electronic transaction system\n        Section Content: 12A\\. —(1)  The Registrar may —\n(a)\nrequire or permit any person to carry out any transaction with the Registrar under this Act; and\n(b)\nissue any approval, certificate, notice, determination or other document pursuant or connected to a transaction referred to in paragraph (a),\nusing the electronic transaction system established under Part 6A of the Accounting and Corporate Regulatory Authority Act 2004.\n(2)  In this section, “transaction”, in relation to the Registrar, means —\n(a)\nthe filing or lodging of any document with the Registrar, or the submission, production, delivery, provision or sending of any document to the Registrar;\n(b)\nany making of any application, submission or request to the Registrar;\n(c)\nany provision of any undertaking or declaration to the Registrar; and\n(d)\nany extraction, retrieval or accessing of any document, record or information maintained by the Registrar.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 12A. Electronic transaction system\n   ...",
    "content_length": 1022,
    "created_at": "2025-03-31T07:24:30.083521",
    "updated_at": "2025-03-31T07:24:43.219072",
    "file_path": "unknown_source"
  },
  "doc-f8f3390c9a81dd40caba240a61677ecf": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 12B. Request for copy of filed documents\n        Section Content: 12B\\. —(1)  A person may, upon payment of such fee as may be prescribed, require a copy of or an extract from any document, as may be prescribed, which is filed with the Registrar, to be given or certified by the Registrar.\n(2)  Any copy or extract given under subsection (1) which is certified to be a true copy or extract by the Registrar is, in any proceedings, admissible in evidence as of equal validity with the original document.\n(3)  Subsection (1) does not apply to any document prescribed as an excluded document for the purposes of this subsection.\n(4)  Where a document is submitted on or after the date of commencement of section 16 of the ACRA (Registry and Regulatory Enhancements) Act 2024 using a form on the electronic transaction system, the reference to a document in subsection (1) excludes the following entries in the form:\n(a)\na means of notification provided by a person for the purposes of section 28A(1)(b) of the Accounting and Corporate Regulatory Authority Act 2004;\n(b)\nan individual’s date of birth obtained under this Act or section 28(1A) of the Accounting and Corporate Regulatory Authority Act 2004;\n(c)\nany other prescribed information.\n(5)  Where —\n(a)\na document is filed or lodged with the Registrar or the Oversight Committee under this Act by submitting a form on the electronic transaction system on or after the date of commencement of section 16 of the ACRA (Registry and Regulatory Enhancements) Act 2024; and\n(b)\nan individual’s residential address is entered in that form,\nthe Registrar must cause the individual’s residential address to be excluded from every copy or extract of that document given or certified by the Registrar under subsection (1).",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 12B. Request for copy of filed documen...",
    "content_length": 1827,
    "created_at": "2025-03-31T07:24:43.256889",
    "updated_at": "2025-03-31T07:25:07.248795",
    "file_path": "unknown_source"
  },
  "doc-fa7e83a5c9b41a450bbabc6d150872d5": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 13. Renewal of registration\n        Section Content: 13\\. —(1)  Unless the Oversight Committee or the Registrar allows otherwise, a public accountant who desires to renew his or her certificate of registration upon its expiry must, at least one month before the date of the expiry, submit his or her application for the renewal to the Oversight Committee in such form or manner as the Oversight Committee may require.\n(2)  An application under subsection (1) must be accompanied by —\n(a)\nthe prescribed fee; and\n(b)\na declaration by the applicant verifying any information contained in or relating to the application.\n(3)  Unless the Oversight Committee determines otherwise, a public accountant is not entitled to have his or her certificate of registration renewed if he or she has failed —\n(a)\nto comply with the prescribed requirements relating to continuing professional education;\n(b)\nto comply with any order made under section 38(1) or (2)(b); or\n(c)\nto satisfy any other requirement that the Oversight Committee thinks relevant.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 13. Renewal of registration\n        Se...",
    "content_length": 1099,
    "created_at": "2025-03-31T07:25:07.300709",
    "updated_at": "2025-03-31T07:25:22.478304",
    "file_path": "unknown_source"
  },
  "doc-d2dc2c70cd46b351822cd5f20afdb6d4": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 14. Duty to report change in particulars\n        Section Content: 14\\. —(1)  Every public accountant must, whenever there is any change in his or her name, residential address, contact address or any other of his or her relevant particulars as recorded in the Register of Public Accountants, notify the Registrar of such change within 30 days thereof in such manner as the Oversight Committee may require.\n(2)  Any person who, without reasonable excuse, fails to comply with subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000.\n(3)  Where the public accountant has changed his or her residential address and has made a report of the change under section 10 of the National Registration Act 1965, the public accountant is to be taken to have informed the Registrar of the change of residential address in compliance with subsection (1).",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 14. Duty to report change in particula...",
    "content_length": 955,
    "created_at": "2025-03-31T07:25:22.530843",
    "updated_at": "2025-03-31T07:25:36.262967",
    "file_path": "unknown_source"
  },
  "doc-48b7064df436816d3fd43b29a736b765": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 15. Removal from Register of Public Accountants\n        Section Content: 15\\. —(1)  The Registrar must remove from the Register of Public Accountants the name and relevant particulars of any public accountant —\n(a)\nwho has died;\n(b)\nwho has become unfit to practise as a public accountant by reason of any physical or mental condition;\n(c)\nwho has been adjudged a bankrupt;\n(d)\nwho, without reasonable excuse, has failed to renew his or her certificate of registration after one month from the date of the expiry of the certificate of registration;\n(e)\nwhose registration has been cancelled under the provisions of Part 5, 5A or 6; or\n(f)\nwho has applied to the Oversight Committee for his or her registration to be cancelled and whose application has been granted by the Oversight Committee.\n(2)  Subject to subsection (3), any individual whose name has been removed from the Register under subsection (1)(d) may, if he or she desires to be reinstated in the Register, apply to the Registrar for reinstatement within 21 days of his or her being informed by the Registrar of the removal of his or her name from the Register, and the Registrar must, upon payment of the prescribed fee by the applicant, reinstate the applicant to the Register.\n(3)  The Registrar must not remove the name and relevant particulars of a public accountant from the Register of Public Accountants under subsection (1)(d) and the Oversight Committee must not grant an application by a public accountant to cancel his or her registration under subsection (1)(f), if the Registrar or Oversight Committee (as the case may be) has received any complaint or information against the public accountant under Part 6, or if disciplinary proceedings under that Part are pending against the public accountant.\n(4)  The Oversight Committee may also cancel the registration of a public accountant and order the removal of his or her name and relevant particulars from the Register of Public Accountants if it is satisfied that —\n(a)\nthe public accountant has obtained his or her registration by fraud or misrepresentation;\n(b)\nthe public accountant has made any arrangement with his or her creditors;\n(c)\nthe public accountant no longer satisfies any of the requirements prescribed under section 10(1)(b) by virtue of which he or she was registered under this Part;\n(d)\nfor any reason, the public accountant has been censured by any professional accountancy body or organisation of which he or she is a member or with which he or she is registered, or has had his or her membership or registration with the body or organisation terminated or suspended; or\n(e)\nthe public accountant is no longer in a position to discharge the duties of a public accountant effectively.\n(5)  The Oversight Committee must, before exercising its powers under subsection (4), notify the public accountant concerned of its intention to take such action and must give the public accountant an opportunity to submit reasons, within such period as the Oversight Committee may determine, as to why his or her registration should not be cancelled.\n(6)  Any public accountant who is aggrieved by an order under subsection (4) may, within 30 days after being notified of the order, appeal to the Minister whose decision is final.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 15. Removal from Register of Public Ac...",
    "content_length": 3326,
    "created_at": "2025-03-31T07:25:36.312111",
    "updated_at": "2025-03-31T07:26:00.896971",
    "file_path": "unknown_source"
  },
  "doc-eab1434fd7e9fb0ba7f611b188b32931": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 16. Publication of list of public accountants\n        Section Content: 16\\. The Registrar may, from time to time, prepare and publish in such form or manner as the Oversight Committee may determine a list of the names and particulars of all public accountants.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 16. Publication of list of public acco...",
    "content_length": 322,
    "created_at": "2025-03-31T07:26:00.946477",
    "updated_at": "2025-03-31T07:26:14.372087",
    "file_path": "unknown_source"
  },
  "doc-845acab317a07bf64da31d9ffb1aae83": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 17. Approval of accounting corporations\n        Section Content: 17\\. —(1)  A public accountant who wishes to have a company or proposed company approved as an accounting corporation may apply to the Oversight Committee for approval of —\n(a)\nthe company as an accounting corporation; and\n(b)\nthe name or proposed name of the accounting corporation.\n(2)  An application under subsection (1) must be made in accordance with the prescribed requirements and must be accompanied by the prescribed fee.\n(3)  Subject to subsection (4) and any other provisions of this Act, the Oversight Committee may, on receiving an application made under this section, approve the company or proposed company concerned as an accounting corporation if and only if —\n(a)\none of the primary objects of the company or proposed company is to provide public accountancy services;\n(b)\nthe share capital of the company or proposed company that is paid up or to be paid up is at least $50,000 or any other sum that may be prescribed;\n(c)\nthe articles of association of the company or proposed company provide that —\n(i)\nat least two-thirds, or any other proportion that may be prescribed, of the directors (including the chairperson) must be public accountants, or —\n(A)\nif the company or proposed company has only one director, that that director must be a public accountant; or\n(B)\nif the company or proposed company has only 2 directors, that one of those directors must be a public accountant;\n(ii)\nat least two‑thirds, or any other proportion that may be prescribed, of the voting shares of the company or proposed company must be owned by corporate practitioners; and\n(iii)\nonly individuals may own any shares of the company or proposed company;\n(d)\nthe business of the company or proposed company, so far as it relates to the provision of public accountancy services in Singapore, will be under the control and management of one or more directors of the company who are public accountants ordinarily resident in Singapore; and\n(e)\nthe company or proposed company is or will be covered by professional indemnity insurance in accordance with section 28 and the prescribed requirements.\n(4)  If the Oversight Committee grants its approval for a proposed company to be an accounting corporation, the approval is not to take effect until the company is formed and registered under the Companies Act 1967.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 17. Approval of accounting corporation...",
    "content_length": 2438,
    "created_at": "2025-03-31T07:26:14.430566",
    "updated_at": "2025-03-31T07:26:32.788046",
    "file_path": "unknown_source"
  },
  "doc-06dbc41b134b866a6d69a3543f5398a9": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 18. Approval of accounting firms\n        Section Content: 18\\. —(1)  A public accountant who wishes to have a firm or proposed firm approved as an accounting firm may apply to the Oversight Committee for approval of —\n(a)\nthe firm as an accounting firm; and\n(b)\nthe name or proposed name of the accounting firm.\n(2)  An application under subsection (1) must be made in accordance with the prescribed requirements and must be accompanied by the prescribed fee.\n(3)  The Oversight Committee may, on receiving an application made under this section, approve the firm or proposed firm concerned as an accounting firm if and only if —\n(a)\none of the primary objects of the firm or proposed firm is to provide public accountancy services;\n(b)\nat least two-thirds, or any other proportion that may be prescribed, of the partners are public accountants, or if the partnership has only 2 partners, one of those partners is a public accountant; and\n(c)\nthe business of the partnership, so far as it relates to the supply of public accountancy services in Singapore, will be under the control and management of one or more partners who are public accountants ordinarily resident in Singapore.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 18. Approval of accounting firms\n     ...",
    "content_length": 1243,
    "created_at": "2025-03-31T07:26:32.843312",
    "updated_at": "2025-03-31T07:26:45.725568",
    "file_path": "unknown_source"
  },
  "doc-dcfd069438ae8c33ca9fea108ce7f2cc": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 18A. Approval of accounting LLPs\n        Section Content: 18A\\. —(1)  A public accountant who wishes to have a limited liability partnership or proposed limited liability partnership approved as an accounting LLP may apply to the Oversight Committee for the approval of —\n(a)\nthe limited liability partnership as an accounting LLP; and\n(b)\nthe name or proposed name of the accounting LLP.\n(2)  An application under subsection (1) must be made in accordance with the prescribed requirements and must be accompanied by the prescribed fee.\n(3)  The Oversight Committee may, on receiving an application made under this section, approve the limited liability partnership or proposed limited liability partnership concerned as an accounting LLP if and only if —\n(a)\none of the primary objects of the limited liability partnership or proposed limited liability partnership is to provide public accountancy services;\n(b)\nthe capital of the limited liability partnership or proposed limited liability partnership that is paid up or to be paid up is at least $50,000 or any other sum that may be prescribed;\n(c)\nat least two-thirds, or any other proportion that may be prescribed, of the partners are public accountants, or if the partnership has only 2 partners, one of those partners is a public accountant;\n(d)\nthe accounting LLP or proposed accounting LLP is or will be covered by professional indemnity insurance in accordance with section 28 and the prescribed requirements; and\n(e)\nthe business of the accounting LLP, so far as it relates to the supply of public accountancy services in Singapore, will be under the control and management of one or more partners who are public accountants ordinarily resident in Singapore.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 18A. Approval of accounting LLPs\n     ...",
    "content_length": 1782,
    "created_at": "2025-03-31T07:26:45.790981",
    "updated_at": "2025-03-31T07:27:19.478034",
    "file_path": "unknown_source"
  },
  "doc-c8115c5c278f39fd8594fe6db0e7bd53": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 19. Name of accounting corporation, accounting firm or accounting LLP\n        Section Content: 19\\. —(1)  The Oversight Committee must not approve the name or proposed name, or any proposed change in the name, of an accounting corporation, accounting firm or accounting LLP if it is of the opinion that the name or proposed name —\n(a)\nis undesirable; or\n(b)\nis a name of a kind that the Authority has directed the Oversight Committee not to accept for registration.\n(2)  Despite section 27 of the Companies Act 1967, an accounting corporation which is a limited company need not have the word “Limited” or “Berhad” as part of its name and an accounting corporation which is a private company need not have the word “Private” or “Sendirian” as part of its name.\n(3)  Every accounting corporation must have either the words “Public Accounting Corporation” as part of its name or the acronym “PAC” at the end of its name, and a person, firm or company other than an approved accounting corporation must not have such words or acronym as part of or at the end of its name, as the case may be.\n(4)  The name of an accounting corporation, accounting firm or accounting LLP must not be changed without the prior written approval of the Oversight Committee.\n(5)  Despite anything in this section, section 27 of the Companies Act 1967 or section 23 of the Limited Liability Partnerships Act 2005, where the Oversight Committee is satisfied that the name of an accounting corporation, accounting firm or accounting LLP has been approved (whether through inadvertence or otherwise and whether originally or by change of name) in contravention of subsection (1), the Oversight Committee may direct the accounting corporation, accounting firm or accounting LLP to change its name.\n(6)  The accounting corporation, accounting firm or accounting LLP must comply with the direction of the Oversight Committee under subsection (5) within 6 weeks after the date of the direction or any longer period that the Oversight Committee may allow unless the direction is annulled by the Minister.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 19. Name of accounting corporation, ac...",
    "content_length": 2132,
    "created_at": "2025-03-31T07:27:19.545545",
    "updated_at": "2025-03-31T07:27:42.756889",
    "file_path": "unknown_source"
  },
  "doc-9df0481ab2dd5140da55537a2b324105": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 2. Interpretation\n        Section Content: 2\\. —(1)  In this Act, unless the context otherwise requires —\n“accounting corporation” means a company approved as an accounting corporation under section 17;\n“accounting firm” means a firm approved as an accounting firm under section 18;\n“accounting limited liability partnership” or “accounting LLP” means a limited liability partnership approved as an accounting limited liability partnership under section 18A;\n[\nDeleted by Act 21 of 2024 wef 09/12/2024\n]\n“ACRA administered Act” means the Accounting and Corporate Regulatory Authority Act 2004 or any of the written laws specified in the Second Schedule to that Act;\n“Authority” means the Accounting and Corporate Regulatory Authority established under the Accounting and Corporate Regulatory Authority Act 2004;\n“Chairperson” means the Chairperson of the Oversight Committee;\n“company” has the meaning given by the Companies Act 1967;\n“Complaints and Disciplinary Panel” means the Complaints and Disciplinary Panel appointed under section 39;\n“Complaints Committee” means a Complaints Committee constituted under Part 6;\n“contact address”, in relation to an individual, means an address that meets all of the following conditions:\n(a)\nit is a physical address at which the individual can be physically found or contacted by post;\n(b)\nit is not a post office box number;\n(c)\nit is located in the same jurisdiction as the individual’s residential address;\n“corporate practitioner” —\n(a)\nin relation to an accounting corporation, means a director or an employee of the corporation who is a public accountant and practising as such in that corporation; and\n(b)\nin relation to an accounting LLP, means a partner or an employee of the accounting LLP who is a public accountant and practising as such in the accounting LLP;\n“costs and expenses”, in relation to any proceedings under Part 6, includes —\n(a)\nthe costs and expenses of any legal assessor and any advocate and solicitor appointed by the Oversight Committee for proceedings before a Complaints Committee or a Disciplinary Committee;\n(b)\nsuch reasonable expenses as the Oversight Committee may pay to witnesses; and\n(c)\nsuch reasonable expenses as are necessary for, or incidental to, the institution and conduct of proceedings before a Complaints Committee or a Disciplinary Committee;\n“Disciplinary Committee” means a Disciplinary Committee constituted under Part 6;\n“electronic transaction system” means the electronic transaction system mentioned in section 12A(1);\n“firm” means a sole proprietorship or partnership;\n“full name” or “name” means —\n(a)\nin the case of an individual registered under the National Registration Act 1965 — the name as it appears in the latest identity card issued to that individual under section 9 of that Act; or\n(b)\nin the case of an individual not registered under the National Registration Act 1965 — the name as it appears in the latest passport issued to that individual or such other similar evidence of identification as is available;\n“identification” means —\n(a)\nin the case of an individual issued with an identity card under the National Registration Act 1965, the number of the individual’s identity card; and\n(b)\nin the case of an individual not issued with an identity card under that Act, particulars of the individual’s passport or other similar evidence of identity that is acceptable to the Registrar;\n“lay person”, in relation to the Complaints and Disciplinary Panel, a Complaints Committee or a Disciplinary Committee, means an architect, a banker, an advocate and solicitor, a company director, an insurer, a professional engineer, a medical practitioner or a person who possesses such other qualifications as may be approved by the Oversight Committee;\n“limited liability partnership” has the meaning given by section 4(1) of the Limited Liability Partnerships Act 2005;\n“manager”, in relation to a limited liability partnership, has the meaning given by section 2(1) of the Limited Liability Partnership Act 2005;\n“Oversight Committee” means the Public Accountants Oversight Committee appointed by the Authority under section 4;\n“professional indemnity insurance” includes insurance indemnifying a public accountant, an accounting corporation, an accounting firm or an accounting LLP against liability to compensate a third party who has sustained financial loss or any other damage or injury due to a breach of professional duty or to any professional negligence on the part of such public accountant, accounting corporation, accounting firm or accounting LLP, as the case may be (including any such negligence by any director of such accounting corporation or any partner of such accounting LLP), or fraud or dishonesty;\n“public accountancy services” means the audit and reporting on financial statements and the doing of any other acts that are required by any written law to be done by a public accountant;\n“public accountant” means an individual who is registered or deemed to be registered in accordance with this Act as a public accountant;\n“Register of Public Accountants” means the register kept and maintained under section 5(1)(a)(i);\n“Register of Public Accounting Corporations” means the register kept and maintained under section 5(1)(a)(ii);\n“Register of Public Accounting Firms” means the register kept and maintained under section 5(1)(a)(iii);\n“Register of Public Accounting Limited Liability Partnerships” means the register kept and maintained under section 5(1)(a)(iv);\n“Registrar” means the Registrar of Public Accountants appointed by the Authority under section 7(1)(a) and includes a Deputy Registrar and an Assistant Registrar appointed under section 7(1)(b);\n“relevant particulars”, in relation to a public accountant, an accounting corporation, an accounting firm or an accounting LLP, means such particulars of the public accountant, accounting corporation, accounting firm or accounting LLP as the Oversight Committee may determine to be relevant for inclusion in the Register of Public Accountants, the Register of Public Accounting Corporations, the Register of Public Accounting Firms or the Register of Public Accounting Limited Liability Partnerships, as the case may be;\n“repealed Accountants Act” means the Accountants Act (Cap. 2, 2001 Revised Edition) in force immediately before 1 April 2004;\n“residential address”, in relation to an individual, means the individual’s usual place of residence;\n“rules” means rules made under section 64;\n“voting share”, in relation to a company or an accounting corporation, means an issued share in the company or accounting corporation other than —\n(a)\na share to which, in no circumstances, is there attached a right to vote; or\n(b)\na share to which there is attached a right to vote only in one or more of the following circumstances:\n(i)\nduring a period in which a dividend (or part of a dividend) in respect of the share is in arrears;\n(ii)\nupon a proposal to reduce the share capital of the company or accounting corporation;\n(iii)\nupon a proposal that affects rights attached to the share;\n(iv)\nupon a proposal to wind up the company or accounting corporation;\n(v)\nupon a proposal for the disposal of the whole of the property, business and undertakings of the company or accounting corporation;\n(vi)\nduring the winding up of the company or accounting corporation.\n(2)  In this Act, a reference to improper conduct by, of or on the part of, a public accountant, an accounting corporation, an accounting firm or an accounting LLP includes any breach of any code of professional conduct and ethics prescribed by order under section 64AA(1)(a).\n(3)  For the purposes of sections 11(7), 15(6), 20(1), (3) and (4), 31(7) and 48(3), (4) and (5), any reference to the Minister includes a reference to such Minister of State for his or her Ministry who is authorised by the Minister for the purpose of hearing an appeal under that section.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 2. Interpretation\n        Section Cont...",
    "content_length": 7985,
    "created_at": "2025-03-31T07:27:42.827864",
    "updated_at": "2025-03-31T07:28:18.248951",
    "file_path": "unknown_source"
  },
  "doc-dbf50348b435d14acc82b407bebe449f": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 20. Right of appeal against decision of Oversight Committee\n        Section Content: 20\\. —(1)  An applicant for approval by the Oversight Committee of —\n(a)\na company or proposed company as an accounting corporation;\n(b)\na firm or proposed firm as an accounting firm;\n(c)\na limited liability partnership or proposed limited liability partnership as an accounting LLP; or\n(d)\nthe name or a change in the name of an accounting corporation, accounting firm or accounting LLP,\nmay, within 30 days after the Oversight Committee’s decision under section 17, 18, 18A or 19 (as the case may be) is communicated to the applicant, appeal to the Minister against the decision of the Oversight Committee.\n(2)  An applicant making an appeal under subsection (1) must comply with the prescribed requirements relating to such an appeal.\n(3)  On the hearing of an appeal, the Minister may —\n(a)\nconfirm the decision of the Oversight Committee; or\n(b)\ndirect the Oversight Committee to grant the application for approval, either unconditionally or subject to conditions specified by the Minister,\nand may make such order as to the payment of costs by the Authority or by the applicant as the Minister thinks fit.\n(4)  The decision of the Minister on appeal under subsection (3) is final.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 20. Right of appeal against decision o...",
    "content_length": 1333,
    "created_at": "2025-03-31T07:28:18.326826",
    "updated_at": "2025-03-31T07:28:41.973993",
    "file_path": "unknown_source"
  },
  "doc-1ee6ee1455a47bea58331ec1ef25c6a8": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 21. Notification of approval and record in Register\n        Section Content: 21\\. Where the Oversight Committee has approved a company, a firm or a limited liability partnership as an accounting corporation, an accounting firm or an accounting LLP under this Part, the Registrar must —\n(a)\nnotify the accounting corporation, accounting firm or accounting LLP of the approval; and\n(b)\nrecord the name and relevant particulars of the accounting corporation, accounting firm or accounting LLP in the Register of Public Accounting Corporations, the Register of Public Accounting Firms or the Register of Public Accounting Limited Liability Partnerships, as appropriate.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 21. Notification of approval and recor...",
    "content_length": 727,
    "created_at": "2025-03-31T07:28:42.054677",
    "updated_at": "2025-03-31T07:28:59.492128",
    "file_path": "unknown_source"
  },
  "doc-6d9eb813ce9efe56588cf2c13ddd5d97": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 22. Duty to report change in particulars\n        Section Content: 22\\. —(1)  A public accountant must notify the Registrar of any change in the name or relevant particulars, as recorded in the Register of Public Accounting Corporations, the Register of Public Accounting Firms or the Register of Public Accounting Limited Liability Partnerships (as the case may be) of the accounting corporation, accounting firm or accounting LLP in which he or she is practising.\n(2)  Any notification under subsection (1) must be given within 30 days of the change and in such manner as the Oversight Committee may require.\n(3)  Any person who, without reasonable excuse, fails to comply with this section shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $1,000.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 22. Duty to report change in particula...",
    "content_length": 849,
    "created_at": "2025-03-31T07:28:59.589425",
    "updated_at": "2025-03-31T07:29:20.806131",
    "file_path": "unknown_source"
  },
  "doc-bef983d866e8eba6bf852e76240e4290": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 23. Effect of company becoming accounting corporation\n        Section Content: 23\\. —(1)  An accounting corporation is authorised to do anything that a public accountant can do by law and is required to do all that a public accountant is required to do by law in respect of the provision of public accountancy services by that accounting corporation.\n(2)  Subsection (1) does not apply to the doing of anything that can only be done by a public accountant as an individual.\n(3)  A public accountant who provides public accountancy services as a director or an employee of an accounting corporation is subject to the same standards of professional conduct and competence in respect of such services as if he or she were personally providing the public accountancy services as a public accountant in an accounting firm.\n(4)  The mere fact that a public accountant personally provides public accountancy services as a director or an employee of an accounting corporation shall not affect the personal liability of that public accountant at law.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 23. Effect of company becoming account...",
    "content_length": 1103,
    "created_at": "2025-03-31T07:29:20.892032",
    "updated_at": "2025-03-31T07:29:32.679954",
    "file_path": "unknown_source"
  },
  "doc-9516c26d18daddb2632e65e1cc7fb17a": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 23A. Effect of becoming accounting LLP\n        Section Content: 23A\\. —(1)  An accounting LLP is authorised to do anything that a public accountant can do by law and is required to do all that a public accountant is required to do by law in respect of the provision of public accountancy services by that accounting LLP.\n(2)  Subsection (1) does not apply to the doing of anything that can only be done by a public accountant as an individual.\n(3)  A public accountant who provides public accountancy services as a partner or an employee of an accounting LLP is subject to the same standards of professional conduct and competence in respect of such services as if he or she were personally providing the public accountancy services as a public accountant in an accounting firm.\n(4)  The mere fact that a public accountant personally provides public accountancy services as a partner or an employee of an accounting LLP shall not affect the personal liability of that public accountant at law.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 23A. Effect of becoming accounting LLP...",
    "content_length": 1055,
    "created_at": "2025-03-31T07:29:32.782048",
    "updated_at": "2025-03-31T07:29:45.638510",
    "file_path": "unknown_source"
  },
  "doc-330a28747a8eb7f291dbc33e8e402ab9": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 24. Relationship between client and accounting corporation or accounting LLP\n        Section Content: 24\\. An accounting corporation and an accounting LLP have the same rights and are subject to the same fiduciary, confidential and ethical requirements with respect to each client of the accounting corporation or accounting LLP (as the case may be) in respect of the provision of public accountancy services that exist at law with respect to a public accountant and his or her client.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 24. Relationship between client and ac...",
    "content_length": 547,
    "created_at": "2025-03-31T07:29:45.725740",
    "updated_at": "2025-03-31T07:29:59.580207",
    "file_path": "unknown_source"
  },
  "doc-419990811839e2f16bfed082f167d205": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 25. Professional misconduct\n        Section Content: 25\\. —(1)  An act or omission of a public accountant may constitute improper or dishonourable conduct in the discharge of his or her professional duty even though it is only done or occurs while the public accountant provides public accountancy services through an accounting corporation, an accounting firm or an accounting LLP.\n(2)  The directors of an accounting corporation or the partners of an accounting firm or an accounting LLP who are public accountants shall be jointly liable to disciplinary proceedings under this Act if the business of the accounting corporation, accounting firm or accounting LLP is conducted in a manner which would warrant disciplinary proceedings against it and where such conduct cannot be attributed to the act or omission of any particular public accountant or public accountants.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 25. Professional misconduct\n        Se...",
    "content_length": 933,
    "created_at": "2025-03-31T07:29:59.669534",
    "updated_at": "2025-03-31T07:30:15.984722",
    "file_path": "unknown_source"
  },
  "doc-42fa1fbdfb0cfb7785532f83ef509346": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 26. Requirements relating to memorandum and articles of association, and annual reports, of accounting corporations\n        Section Content: 26\\. —(1)  The memorandum and articles of association of an accounting corporation must at all times comply with all the requirements specified in section 17(3)(a) and (c) and the rules relating thereto.\n(2)  An accounting corporation must, within 30 days after the occurrence of —\n(a)\nany amendment to its memorandum or articles of association;\n(b)\nany change in the composition of its board of directors who are public accountants;\n(c)\nany change in the proportion of its voting shares owned by corporate practitioners; or\n(d)\nany change in the number of its corporate practitioners,\nprovide the Registrar with a true report in writing giving full particulars of the amendment or change.\n(3)  In addition to the requirements in subsection (2), every accounting corporation must in every year, not later than a date specified by the Oversight Committee, send to the Registrar an annual report relating to the accounting corporation in such form as the Oversight Committee may require.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 26. Requirements relating to memorandu...",
    "content_length": 1188,
    "created_at": "2025-03-31T07:30:16.077125",
    "updated_at": "2025-03-31T07:30:30.508530",
    "file_path": "unknown_source"
  },
  "doc-c3507dcb9a2fc20626afe3ad5d8df96c": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 27. Shares of accounting corporation\n        Section Content: 27\\. —(1)  Subject to the provisions of this Act, the voting shares in an accounting corporation must at all times be owned by corporate practitioners in the proportions referred to in section 17(3)(c)(ii) and must comply with the prescribed requirements.\n(2)  The share capital of an accounting corporation which is paid up must at all times be at least a sum of $50,000 or any other sum that may be prescribed.\n(3)  No share in an accounting corporation may be held by a person as nominee for another person and no security may be created over any share in an accounting corporation.\n(4)  Any purchase or acquisition of a share of an accounting corporation, and any security created over any such share, in contravention of subsection (3) is null and void.\n(5)  A public accountant whose registration is cancelled under Part 5, 5A or 6 must not —\n(a)\nhold any shares in any accounting corporation; or\n(b)\ndirectly or indirectly, take part or be concerned in the management or practice of any accounting corporation without the permission of the Oversight Committee,\nunless and until he or she is subsequently reinstated as a registered public accountant.\n(6)  A public accountant whose registration is suspended under Part 5, 5A or 6 must not, during the period of suspension —\n(a)\nexercise any voting rights attached to his or her shares in any accounting corporation; or\n(b)\ntake part or be concerned in the management or practice of any accounting corporation without the permission of the Oversight Committee.\n(7)  Despite subsections (1) and (5), where any individual who is a member of an accounting corporation by virtue of being a corporate practitioner has, for any reason other than those mentioned in subsection (8), ceased to be —\n(a)\na public accountant; or\n(b)\na director or an employee of the accounting corporation,\nthe Oversight Committee may, upon an application made by that individual or by the accounting corporation concerned, grant him or her a grace period of not more than 2 years to transfer his or her voting shares in the accounting corporation.\n(8)  Despite subsection (1), where any individual who is a member of an accounting corporation by virtue of being a corporate practitioner has, by reason of death, bankruptcy or incapacity due to mental or physical disability —\n(a)\nceased to be a public accountant; or\n(b)\nceased to be a director or an employee of the accounting corporation,\nthe Oversight Committee may, upon the application of the accounting corporation concerned, allow the administrator or executor of that individual’s estate, the trustee in bankruptcy or the committee of that estate (as the case may be) to hold the individual’s voting shares in the accounting corporation for a grace period.\n(9)  The grace period mentioned in subsection (8) is a period not exceeding 2 years starting —\n(a)\nin the case of death, from the date the administrator or executor is appointed by the court;\n(b)\nin the case of bankruptcy, from the date the individual is adjudged a bankrupt; or\n(c)\nin the case of incapacity by reason of mental or physical disability, from the date the individual becomes incapable to act.\n(10)  The person or persons who are allowed under subsections (7) and (8), respectively, a grace period to transfer or hold voting shares in an accounting corporation are treated as corporate practitioners for the purposes of computing the proportion of any voting shares in the accounting corporation which is required by section 17(3)(c)(ii) to be owned by corporate practitioners.\n(11)  The person or persons who are allowed under subsections (7) and (8), respectively, a grace period to transfer or hold voting shares in an accounting corporation must not during the grace period exercise any voting rights attached to the person’s or persons’ voting shares in the accounting corporation or take part or be concerned in the management or practice of the accounting corporation.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 27. Shares of accounting corporation\n ...",
    "content_length": 4056,
    "created_at": "2025-03-31T07:30:30.611690",
    "updated_at": "2025-03-31T07:30:56.810936",
    "file_path": "unknown_source"
  },
  "doc-c1c8f65852558a2a69933922a8f30343": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 28. Professional indemnity insurance\n        Section Content: 28\\. —(1)  Every accounting corporation and every accounting LLP registered under this Act must be covered by professional indemnity insurance of at least one of the following amounts, whichever is the highest:\n(a)\n$1 million;\n(b)\na sum equal to the total of $500,000 for every corporate practitioner in the accounting corporation or accounting LLP;\n(c)\nwhere applicable, a sum equal to two and a half times the gross income of the accounting corporation or accounting LLP in the last completed financial year of the accounting corporation or accounting LLP subject to a maximum sum of $50 million.\n(2)  The Authority may, by rules, vary the amount of coverage under a professional indemnity insurance required by subsection (1).",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 28. Professional indemnity insurance\n ...",
    "content_length": 853,
    "created_at": "2025-03-31T07:30:56.914247",
    "updated_at": "2025-03-31T07:31:11.405952",
    "file_path": "unknown_source"
  },
  "doc-871c511b7aa12dca3251f62c41fcdeef": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 29. Management of accounting corporation\n        Section Content: 29\\. —(1)  Only members of an accounting corporation may be appointed as directors of the accounting corporation.\n(2)  The business of an accounting corporation, so far as it relates to the provision of public accountancy services, must be under the control and management of one or more directors who are public accountants.\n(3)  Where, for any reason, the office of director required to be held by a public accountant under section 17(3)(c)(i) is vacated, the accounting corporation must, as soon as practicable but no later than one month after the date of vacation of office, appoint another public accountant to fill the vacancy.\n(4)  The directors of an accounting corporation must ensure that every invoice or official correspondence of the accounting corporation bears the statement that it is incorporated with limited liability.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 29. Management of accounting corporati...",
    "content_length": 966,
    "created_at": "2025-03-31T07:31:11.510544",
    "updated_at": "2025-03-31T07:31:25.981418",
    "file_path": "unknown_source"
  },
  "doc-6969e12d33bd53e08fd9ade98b488319": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 3. Administration of Act\n        Section Content: 3\\. The Authority is responsible —\n(a)\nfor the registration of public accountants and the approval of accounting corporations, accounting firms and accounting LLPs and the names thereof under this Act;\n(b)\nfor the control and regulation of the practice of the profession of accountancy by public accountants, accounting corporations, accounting firms and accounting LLPs; and\n(c)\ngenerally, for the administration of this Act,\nand must carry out those functions subject to the general or special directions of the Minister.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 3. Administration of Act\n        Secti...",
    "content_length": 635,
    "created_at": "2025-03-31T07:31:26.095629",
    "updated_at": "2025-03-31T07:31:44.085085",
    "file_path": "unknown_source"
  },
  "doc-cdfa5ad72920f8e12447ebb32b370fd5": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 30. Application of Companies Act 1967 and other written laws to accounting corporations\n        Section Content: 30\\. —(1)  Nothing in this Part, with the exception of section 19(2), affects the operation of the Companies Act 1967 in relation to its application to a company that is an accounting corporation.\n(2)  An accounting corporation is, notwithstanding that the shares in the accounting corporation are held by more than 20 members, deemed to be an exempt private company for the purposes of the Companies Act 1967.\n(3)  An accounting corporation is not treated for the purposes of the Companies Act 1967 as a public company merely because it has more than 50 members.\n(4)  Such provisions of any written law having effect in relation to public accountants or accounting firms as may be prescribed, have effect in relation to accounting corporations with such prescribed modifications as may be necessary or expedient; and such provisions are to be construed accordingly.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 30. Application of Companies Act 1967 ...",
    "content_length": 1041,
    "created_at": "2025-03-31T07:31:44.199072",
    "updated_at": "2025-03-31T07:32:02.273004",
    "file_path": "unknown_source"
  },
  "doc-4e29f3c4e10835bd7c331b2ff1e3039b": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 30A. Application of Limited Liability Partnerships Act 2005 and other written laws to accounting LLPs\n        Section Content: 30A\\. —(1)  Nothing in this Part affects the operation of the Limited Liability Partnerships Act 2005 in relation to its application to a limited liability partnership that is an accounting LLP.\n(2)  Such provisions of any written law having effect in relation to public accountants or accounting firms as may be prescribed, have effect in relation to accounting LLPs with such prescribed modifications as may be necessary or expedient; and such provisions are to be construed accordingly.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 30A. Application of Limited Liability ...",
    "content_length": 678,
    "created_at": "2025-03-31T07:32:02.380359",
    "updated_at": "2025-03-31T07:32:13.925798",
    "file_path": "unknown_source"
  },
  "doc-90ecedfa63a25a9ac05622b35a4f4588": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 31. Removal from Register of Public Accounting Corporations, Register of Public Accounting Firms or Register of Public Accounting Limited Liability Partnerships\n        Section Content: 31\\. —(1)  The Registrar must remove from the Register of Public Accounting Corporations the name and relevant particulars of any accounting corporation if —\n(a)\nthe accounting corporation has been wound up;\n(b)\nthe approval of the accounting corporation under this Part has been revoked under Part 5A or 6; or\n(c)\nthe accounting corporation has applied for its approval under this Part to be revoked.\n(2)  The Registrar must remove from the Register of Public Accounting Firms the name and relevant particulars of any accounting firm if —\n(a)\nthe accounting firm has been dissolved;\n(b)\nthe approval of the accounting firm under this Part has been revoked under Part 5A or 6; or\n(c)\nthe accounting firm has applied for its approval under this Part to be revoked.\n(3)  The Registrar must remove from the Register of Public Accounting Limited Liability Partnerships the name and relevant particulars of any accounting LLP if —\n(a)\nthe accounting LLP has been dissolved;\n(b)\nthe approval of the accounting LLP under this Part has been revoked under Part 5A or 6; or\n(c)\nthe accounting LLP has applied for its approval under this Part to be revoked.\n(4)  The Oversight Committee must not grant an application by an accounting corporation, an accounting firm or an accounting LLP for the revocation of its approval under subsection (1)(c), (2)(c) or (3)(c) (as the case may be) if —\n(a)\nit has received any complaint or information under Part 6 against the accounting corporation, accounting firm or accounting LLP or any public accountant practising therein;\n(b)\ndisciplinary proceedings under Part 6 are pending against the accounting corporation, accounting firm or accounting LLP or any public accountant practising therein; or\n(c)\nthe conduct of business of the accounting corporation, accounting firm or accounting LLP is the subject of an inquiry or investigation by a Complaints Committee or a Disciplinary Committee under Part 6.\n(5)  The Oversight Committee may also revoke its approval of an accounting corporation or an accounting firm and order the removal of its name and relevant particulars from the appropriate Register if it is satisfied that —\n(a)\nthe approval of the accounting corporation, accounting firm or accounting LLP under this Part has been obtained by fraud or misrepresentation;\n(b)\nthe accounting corporation, the sole proprietor or any partner of the accounting firm, or any partner of the accounting LLP (as the case may be) has made an arrangement with its or his or her creditors;\n(c)\nthe accounting corporation, accounting firm or accounting LLP has ceased to provide public accountancy services in Singapore; or\n(d)\nthe accounting corporation, accounting firm or accounting LLP is no longer in a position to provide public accountancy services effectively.\n(6)  The Oversight Committee must, before exercising its powers under subsection (5), notify the accounting corporation, accounting firm or accounting LLP concerned of its intention to take such action and must give the accounting corporation, accounting firm or accounting LLP an opportunity to submit reasons, within such period as the Oversight Committee may determine, as to why its approval under this Part should not be revoked.\n(7)  Any person who is aggrieved by an order under subsection (5) may, within 30 days of being notified of the order, appeal to the Minister whose decision is final.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 31. Removal from Register of Public Ac...",
    "content_length": 3639,
    "created_at": "2025-03-31T07:32:14.034491",
    "updated_at": "2025-03-31T07:32:33.834151",
    "file_path": "unknown_source"
  },
  "doc-494b0602c0eba48c99673559d2d53fcb": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 32. Interpretation of this Part\n        Section Content: 32\\. In this Part —\n[\nDeleted by Act 32 of 2022 wef 01/07/2023\n]\n“Oversight Committee’s professional standards assessment framework” means the assessment framework of the Oversight Committee to determine the extent of a public accountant’s compliance with the professional standards;\n“practice monitoring programme” means a programme to determine whether a public accountant has complied with the professional standards when providing public accountancy services;\n“Practice Monitoring Sub-committee” means the Practice Monitoring Sub‑committee appointed under section 34;\n“practice review” means a study, an appraisal, or a review carried out under a practice monitoring programme in respect of one or more aspects of the public accountancy services that are provided by a public accountant;\n[\nDeleted by Act 32 of 2022 wef 01/07/2023\n]\n“practice reviewer” means any individual who is appointed by the Oversight Committee under section 35 to carry out a practice review;\n“professional standards”, in relation to the provision of public accountancy services, means the standards, methods, procedures and other requirements that are prescribed by the Authority or Oversight Committee to be applied by a public accountant, an accounting corporation, an accounting firm and an accounting LLP when providing public accountancy services.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 32. Interpretation of this Part\n      ...",
    "content_length": 1450,
    "created_at": "2025-03-31T07:32:33.944454",
    "updated_at": "2025-03-31T07:32:53.310741",
    "file_path": "unknown_source"
  },
  "doc-a44b2a49515857c21da7915b5bdeb249": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 33. Practice monitoring programme for public accountants\n        Section Content: 33\\. —(1)  The Oversight Committee may require, as a condition for a public accountant to be allowed to remain in practice, that the public accountant should undergo, at such periods as the Oversight Committee may determine, a practice monitoring programme under this Part.\n(2)  A public accountant undergoing a practice monitoring programme must pay any fee prescribed in connection with the administration of the practice monitoring programme.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 33. Practice monitoring programme for ...",
    "content_length": 589,
    "created_at": "2025-03-31T07:32:53.422615",
    "updated_at": "2025-03-31T07:33:01.965901",
    "file_path": "unknown_source"
  },
  "doc-dae7213b78ca2f8f3a3c4dce65849563": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 34. Appointment of Practice Monitoring Sub-committee\n        Section Content: 34\\. —(1)  The Oversight Committee may, with the approval of the Authority, appoint a Practice Monitoring Sub‑committee to assist the Oversight Committee in designing and implementing the practice monitoring programmes for the purposes of this Part.\n(2)  The Oversight Committee must designate one of the members of the Practice Monitoring Sub‑committee to be its chairperson.\n(3)  The term of office of a member of the Practice Monitoring Sub‑committee is to be determined by the Oversight Committee.\n(4)  Subject to this Part and to any general or special direction of the Authority or the Oversight Committee, the Practice Monitoring Sub‑committee may regulate its own procedure and business.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 34. Appointment of Practice Monitoring...",
    "content_length": 835,
    "created_at": "2025-03-31T07:33:02.078532",
    "updated_at": "2025-03-31T07:33:19.078423",
    "file_path": "unknown_source"
  },
  "doc-76650f079a5b161b757766a4cb0e9825": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 35. Appointment of practice reviewers\n        Section Content: 35\\. The Oversight Committee may appoint any employee of the Authority or any other suitably qualified individual as a practice reviewer to carry out any practice review under this Part.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 35. Appointment of practice reviewers\n...",
    "content_length": 311,
    "created_at": "2025-03-31T07:33:19.209937",
    "updated_at": "2025-03-31T07:33:31.453203",
    "file_path": "unknown_source"
  },
  "doc-161fb8b0e7845af3a9f3cb7848a8757a": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 36. Practice reviews\n        Section Content: 36\\. —(1)  A practice reviewer must carry out a practice review in accordance with —\n(a)\nthe relevant provisions of this Part;\n(b)\nthe practice and procedure as may be determined by the Oversight Committee; and\n(c)\nsuch instructions as may be issued by the Authority or the Oversight Committee.\n(2)  The following provisions apply in respect of any practice review under this Part:\n(a)\nany public accountant under review must, if required by the practice reviewer —\n(i)\nproduce to the practice reviewer or afford the practice reviewer access to, any record or document specified by the practice reviewer or any record or other document which is of a class or description so specified and which is in the public accountant’s possession or under the public accountant’s control being in either case a record or other document which the practice reviewer reasonably believes is or may be relevant to the practice review, within such time and at such place as the practice reviewer may reasonably require;\n(ii)\ngive to the practice reviewer such explanation or further particulars in respect of anything produced in compliance with a requirement under sub-paragraph (i) as the practice reviewer shall specify; and\n(iii)\ngive to the practice reviewer all assistance in connection with the practice review which the public accountant is reasonably able to give;\n(b)\nwhere any information or matter relevant to a practice review is recorded otherwise than in a legible form, the power of a practice reviewer to require the production of any record or other document conferred under paragraph (a) includes the power to require the production of a reproduction of any such information or matter or of the relevant part of it in a legible form;\n(c)\na practice reviewer may inspect, examine or make copies of or take any abstract of or extract from any record or document produced under paragraph (a) or (b);\n(d)\na practice reviewer exercising a power under this section must, if so requested by a person affected by such exercise, produce for inspection by such person such evidence of the practice reviewer’s authority as may be provided to the practice reviewer by the Oversight Committee upon the practice reviewer’s appointment as a practice reviewer.\n(3)  Nothing in this section compels the production by a public accountant of a record or document containing a privileged communication by or to a legal practitioner in that capacity.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 36. Practice reviews\n        Section C...",
    "content_length": 2538,
    "created_at": "2025-03-31T07:33:31.592647",
    "updated_at": "2025-03-31T07:33:45.413897",
    "file_path": "unknown_source"
  },
  "doc-5bbf3979f42997871ec0460af2162c84": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 37. Practice reviewer to submit report\n        Section Content: 37\\. —(1)  A practice reviewer who carries out a practice review under this Part must submit a report to the Practice Monitoring Sub‑committee at the conclusion of the practice review and at any other stage of the practice review as may be required by the Practice Monitoring Sub‑committee.\n(2)  If, after considering the practice reviewer’s report under subsection (1), the Practice Monitoring Sub-committee is of the opinion that —\n(a)\nthe public accountant’s compliance with any of the professional standards is partially satisfactory under the Oversight Committee’s professional standards assessment framework; or\n(b)\nthe public accountant’s compliance with any of the professional standards is not satisfactory under the Oversight Committee’s professional standards assessment framework,\nthe Practice Monitoring Sub-committee must submit a report of its opinion and recommendations to the Oversight Committee.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 37. Practice reviewer to submit report...",
    "content_length": 1040,
    "created_at": "2025-03-31T07:33:45.533100",
    "updated_at": "2025-03-31T07:34:02.053643",
    "file_path": "unknown_source"
  },
  "doc-d7d2818b1430227dcc02c9401a5a2afd": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38. Where compliance with professional standards by public accountant is partially satisfactory or not satisfactory\n        Section Content: 38\\. —(1)  Where the Oversight Committee, after considering the report and recommendations of the Practice Monitoring Sub‑committee under section 37(2), is satisfied that the public accountant’s compliance with any of the professional standards is partially satisfactory under the Oversight Committee’s professional standards assessment framework, the Oversight Committee may make one or more of the following orders:\n(a)\nan order requiring the public accountant to undergo and satisfactorily complete any remedial programme specified or approved by the Oversight Committee in relation to his or her compliance with the professional standards;\n(b)\nan order requiring the public accountant to take any other steps specified by the Oversight Committee to improve the public accountant’s practice in relation to his or her compliance with the professional standards;\n(c)\nan order requiring the public accountant to give any undertaking in relation to his or her compliance with the professional standards that the Oversight Committee thinks fit;\n(d)\nany other order to improve the public accountant’s compliance with the professional standards that the Oversight Committee thinks necessary or expedient.\n(2)  Where the Oversight Committee, after considering the report and recommendations of the Practice Monitoring Sub‑committee under section 37(2), is satisfied that the public accountant’s compliance with any of the professional standards is not satisfactory under the Oversight Committee’s professional standards assessment framework, the Oversight Committee may —\n(a)\nmake any of the following orders:\n(i)\nan order cancelling the public accountant’s registration;\n(ii)\nan order suspending the public accountant’s registration for a period not exceeding 2 years;\n(iii)\nan order refusing to renew the public accountant’s registration;\n(b)\nin lieu of an order in paragraph (a)(i), (ii) or (iii), or in addition to an order in paragraph (a)(ii), make one or more of the following orders:\n(i)\nan order restricting the public accountant’s provision of public accountancy services in the manner that the Oversight Committee thinks fit for a period not exceeding 2 years;\n(ii)\nan order requiring the public accountant to undergo and satisfactorily complete any remedial programme specified or approved by the Oversight Committee in relation to his or her compliance with the professional standards;\n(iii)\nan order requiring the public accountant to take any other steps specified by the Oversight Committee to improve the public accountant’s practice in relation to his or her compliance with the professional standards;\n(iv)\nan order requiring the public accountant to give any undertaking in relation to his or her compliance with the professional standards that the Oversight Committee thinks fit;\n(v)\nan order requiring the public accountant to send a copy of the order made under this subsection and served on him or her under subsection (8) (or any part of the second‑mentioned order determined by the Oversight Committee), to each person to whom the public accountant provided public accountancy services in respect of which the Oversight Committee is satisfied that the public accountant’s compliance with the professional standards is not satisfactory;\n(vi)\nany other order to improve the public accountant’s compliance with the professional standards that the Oversight Committee thinks necessary or expedient.\n(3)  Where the Oversight Committee has made an order under subsection (1), the Oversight Committee may, having regard to any change in circumstances or for other good reason —\n(a)\nrevoke the order and make any one or more different orders under subsection (1); or\n(b)\nvary the order and make any one or more different orders under subsection (1) in addition to that order.\n(4)  Where the Oversight Committee has made an order under subsection (2)(b), the Oversight Committee may, having regard to any change in circumstances or for other good reason —\n(a)\nrevoke the order and make any one or more different orders under subsection (2)(b); or\n(b)\nvary the order and make any one or more different orders under subsection (2)(b) in addition to that order.\n(5)  Where the Oversight Committee is satisfied that a public accountant has breached any order made under subsection (1), the Oversight Committee may make any of the following orders:\n(a)\nan order cancelling the public accountant’s registration;\n(b)\nan order suspending the public accountant’s registration for a period not exceeding 2 years;\n(c)\nan order refusing to renew the public accountant’s registration.\n(6)  Where the Oversight Committee is satisfied that a public accountant has breached any order made under subsection (2)(b), the Oversight Committee may make any of the following orders:\n(a)\nan order cancelling the public accountant’s registration;\n(b)\nan order suspending the public accountant’s registration for a period not exceeding 2 years;\n(c)\nan order refusing to renew the public accountant’s registration.\n(7)  Where the Oversight Committee makes an order to suspend the public accountant’s registration under subsection (5)(b) or (6)(b), the Oversight Committee may —\n(a)\nin the case of an order under subsection (5)(b) — also make one or more orders under subsection (1); or\n(b)\nin the case of an order under subsection (6)(b) — also make one or more orders under subsection (2)(b).\n(8)  The Registrar must serve a copy of every order made under subsection (1), (2), (3), (4), (5), (6) or (7) on the public accountant concerned.\n(9)  The Oversight Committee may cause any order (or the part of that order determined by the Oversight Committee) that is required to be sent by a public accountant to any person under subsection (2)(b)(v) to be sent to that person if the Oversight Committee has reason to believe that the public accountant has failed to do so.\n(10)  The Oversight Committee must not make an order under subsection (2)(a), (5), (6) or (7) unless it has given the public accountant an opportunity to show cause against the proposed order.\n(11)  An order of the Oversight Committee made under subsection (2)(a), (5), (6) or (7) does not take effect until the latest of the following:\n(a)\none month after the date the order has been served on the public accountant;\n(b)\nthe date specified by the Oversight Committee in the order as the date on which the order takes effect;\n(c)\nwhere an appeal against the order is made to the General Division of the High Court under subsection (12), the date immediately after the date the appeal has been determined or withdrawn.\n(12)  Any public accountant who is aggrieved by an order of the Oversight Committee under subsection (2)(a), (5), (6) or (7) may appeal to the General Division of the High Court within a period of 30 days or within any further period that the General Division of the High Court may allow, after the order of the Oversight Committee has been served on the public accountant.\n(13)  The decision of the General Division of the High Court on an appeal under subsection (12) is final.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38. Where compliance with professional...",
    "content_length": 7255,
    "created_at": "2025-03-31T07:34:02.186269",
    "updated_at": "2025-03-31T07:34:26.586535",
    "file_path": "unknown_source"
  },
  "doc-1daa1cb4a3365206844c6201d5a14c9a": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38A. Refusal to undergo practice monitoring programme\n        Section Content: 38A\\. —(1)  If a public accountant refuses, without reasonable excuse (the burden of proof of which lies with the public accountant), to undergo a practice monitoring programme as required by the Oversight Committee, the Oversight Committee may by order suspend the public accountant’s registration for a period not exceeding 2 years.\n(2)  An order of the Oversight Committee made under subsection (1) does not take effect until the latest of the following:\n(a)\none month after the date the order has been served on the public accountant;\n(b)\nthe date specified by the Oversight Committee in the order as the date on which the order takes effect;\n(c)\nwhere an appeal against the order is made to the General Division of the High Court under subsection (3), the date immediately after the date the appeal has been determined or withdrawn.\n(3)  Any public accountant who is aggrieved by an order of the Oversight Committee under subsection (1) may appeal to the General Division of the High Court within a period of 30 days or within any further period that the General Division of the High Court may allow, after the order of the Oversight Committee has been served on the public accountant.\n(4)  The decision of the General Division of the High Court on an appeal under subsection (3) is final.\n(5)  In this section, without limiting the expression, a public accountant refuses to undergo a practice monitoring programme if the public accountant —\n(a)\nexpressly informs a practice reviewer, the Oversight Committee or the Authority that he or she refuses to undergo the practice monitoring programme;\n(b)\nrefuses to permit a practice reviewer to enter, at any reasonable hours in the day for the purposes of carrying out a practice review, the registered office or business premises of the accounting corporation, accounting firm or accounting LLP in which the public accountant practises as a public accountant;\n(c)\nrefuses to comply with a requirement of a practice reviewer made under section 36(2)(a) or (b) within 14 days after the notice of the requirement has been served on him or her;\n(d)\nrefuses to permit a practice reviewer to inspect, examine or make copies of or take any abstract of or extract from any record or document produced under section 36(2)(a) or (b); or\n(e)\nrefuses, where a written notice requiring the public accountant to undergo a practice monitoring programme has been served on him or her under section 33(1), to respond to the notice within 14 days after the date the notice has been served or any longer period that the practice reviewer, the Oversight Committee or the Authority may allow.\n(6)  This section only applies where a public accountant is required by the Oversight Committee on or after the date of commencement of the Accountants (Amendment) Act 2022 to undergo a practice monitoring programme.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38A. Refusal to undergo practice monit...",
    "content_length": 2982,
    "created_at": "2025-03-31T07:34:26.717444",
    "updated_at": "2025-03-31T07:34:50.736314",
    "file_path": "unknown_source"
  },
  "doc-1b0c3d54704465c9f7d7a549925a5caf": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38B. Interpretation of this Part\n        Section Content: 38B\\. In this Part —\n“accounting entity” means an accounting corporation, an accounting firm or an accounting LLP;\n“AML/CFT requirements” or “Anti-Money Laundering and Countering the Financing of Terrorism requirements” means the prescribed requirements relating to the detection and prevention of money laundering or the financing of terrorism by public accountants and accounting entities;\n“AML/CFT requirements review” means a review to determine the compliance with any AML/CFT requirements by an accounting entity and any of its individual practitioners;\n“entity reviewer” means any individual who is appointed by the Oversight Committee under section 38E to carry out a quality control standards review or an AML/CFT requirements review;\n“individual practitioner”, in relation to an accounting entity, means —\n(a)\nin the case of an accounting corporation or accounting LLP — a corporate practitioner; or\n(b)\nin the case of an accounting firm — a public accountant who is —\n(i)\na partner or an employee of the accounting firm; and\n(ii)\npractising as a public accountant in the accounting firm;\n“Oversight Committee’s quality control standards assessment framework” means the assessment framework of the Oversight Committee to determine the extent of an accounting entity’s compliance with the quality control standards;\n“quality control standards” means the standards, methods or procedures on quality control that are prescribed by the Authority or the Oversight Committee to be applied by an accounting entity when providing public accountancy services;\n“quality control standards review” means a review to determine the compliance with any quality control standards by an accounting entity.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38B. Interpretation of this Part\n     ...",
    "content_length": 1818,
    "created_at": "2025-03-31T07:34:50.869665",
    "updated_at": "2025-03-31T07:35:09.257699",
    "file_path": "unknown_source"
  },
  "doc-e345e7e072df5e6fbf4aead13fef1240": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38C. Composition of Oversight Committee for this Part\n        Section Content: 38C\\. —(1)  For the purposes of this Part, unless the context otherwise requires, a reference to the Oversight Committee means the Oversight Committee without any of its members who are public accountants.\n(2)  A member of the Oversight Committee who is a public accountant must not, directly or indirectly, by himself or herself or by any other person in any manner whatsoever influence or attempt to influence —\n(a)\nthe performance of any of the functions of the Oversight Committee under this Part; or\n(b)\nany deliberation or decision of, or order made or to be made by, the Oversight Committee under this Part.\n(3)  Despite anything in the First Schedule, the Authority may, where the Authority considers it necessary that the Chairperson not act as the Chairperson for the purposes of this Part or for any other reason, appoint another member of the Oversight Committee who is not a public accountant to take the place of the Chairperson for the purposes of this Part and in such a case that other member —\n(a)\nmust act as and discharge the duties of the Chairperson for the purposes of this Part; and\n(b)\nhas the powers of the Chairperson —\n(i)\nspecified in paragraph 7 of the First Schedule in relation to any meeting of the Oversight Committee for the purposes of this Part; and\n(ii)\nto authenticate the common seal specified in paragraph 8 of the First Schedule where necessary for the purposes of this Part.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38C. Composition of Oversight Committe...",
    "content_length": 1558,
    "created_at": "2025-03-31T07:35:09.402570",
    "updated_at": "2025-03-31T07:35:25.565768",
    "file_path": "unknown_source"
  },
  "doc-2bbf4adc3037412374794b60edadb19d": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38D. Requirement to undergo quality control standards review or AML/CFT requirements review\n        Section Content: 38D\\. —(1)  The Oversight Committee may require, as a condition for an accounting entity to remain approved as such, that the accounting entity undergoes a quality control standards review during the periods determined by the Oversight Committee.\n(2)  The Oversight Committee may require, as a condition for an accounting entity to remain approved as such, that —\n(a)\nthe accounting entity undergoes an AML/CFT requirements review during the periods determined by the Oversight Committee; and\n(b)\none or more individual practitioners of the accounting entity undergo an AML/CFT requirements review during the periods determined by the Oversight Committee.\n(3)  Where an accounting entity is required by the Oversight Committee to undergo a quality control standards review under subsection (1) or an AML/CFT requirements review under subsection (2)(a), or both, the accounting entity must —\n(a)\nundergo the quality control standards review or the AML/CFT requirements review, or both, as required by the Oversight Committee by written notice served on the accounting entity; and\n(b)\npay any fee prescribed in connection with the administration of the quality control standards review or the AML/CFT requirements review, or both, as the case may be.\n(4)  Where an individual practitioner is required by the Oversight Committee to undergo an AML/CFT requirements review under subsection (2)(b) —\n(a)\nthe individual practitioner must undergo the AML/CFT requirements review, as required by the Oversight Committee by written notice served on the individual practitioner; and\n(b)\nthe accounting entity, in respect of which the individual practitioner undergoes the AML/CFT requirements review, must pay any fee prescribed in connection with the administration of the AML/CFT requirements review.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38D. Requirement to undergo quality co...",
    "content_length": 1970,
    "created_at": "2025-03-31T07:35:25.709051",
    "updated_at": "2025-03-31T07:35:44.936190",
    "file_path": "unknown_source"
  },
  "doc-69bbe80c30d9ab5c2b9f40ea2b021561": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38E. Appointment of entity reviewers\n        Section Content: 38E\\. —(1)  The Oversight Committee may appoint any employee of the Authority, or any other individual who is suitably qualified, as an entity reviewer to carry out a quality control standards review or an AML/CFT requirements review, or both.\n(2)  An entity reviewer must carry out a quality control standards review or an AML/CFT requirements review, or both, in accordance with —\n(a)\nthe practice and procedures of conducting a quality control standards review or an AML/CFT requirements review determined by the Oversight Committee; and\n(b)\nany instructions issued by the Authority or the Oversight Committee.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38E. Appointment of entity reviewers\n ...",
    "content_length": 737,
    "created_at": "2025-03-31T07:35:45.091390",
    "updated_at": "2025-03-31T07:36:01.537475",
    "file_path": "unknown_source"
  },
  "doc-14b82ad5520463f093b6bc587c90fba3": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38F. Duties and powers of entity reviewers\n        Section Content: 38F\\. —(1)  The following provisions apply where an accounting entity is undergoing a quality control standards review or an AML/CFT requirements review:\n(a)\nthe accounting entity must, if required by the entity reviewer —\n(i)\nproduce to the entity reviewer or give the entity reviewer access to, within the time and at the place reasonably required by the entity reviewer, any record or document, or class or description of records or documents, which is in the possession or under the control of the accounting entity and which the entity reviewer reasonably believes is or may be relevant to the review;\n(ii)\ngive to the entity reviewer any explanation or further particulars in respect of any record or document produced under sub‑paragraph (i) if required by the entity reviewer; and\n(iii)\ngive to the entity reviewer all assistance in connection with the quality control standards review or the AML/CFT requirements review which the accounting entity is reasonably able to give;\n(b)\nwhere any information or matter relevant to the quality control standards review or the AML/CFT requirements review is recorded otherwise than in a legible form, the power of an entity reviewer to require the production of any record or document conferred under paragraph (a) includes the power to require the production of a reproduction of any such information or matter or of the relevant part of it in a legible form;\n(c)\nan entity reviewer may inspect, examine or make copies of or take any abstract of or extract from any record or document produced under paragraph (a) or (b);\n(d)\nan entity reviewer exercising a power under this section must, if so requested by the accounting entity, produce for inspection by the accounting entity, evidence of the entity reviewer’s appointment by the Oversight Committee as an entity reviewer.\n(2)  Where an individual practitioner of an accounting entity is undergoing an AML/CFT requirements review, subsection (1) applies to the individual practitioner as if a reference to an accounting entity in that subsection were a reference to the individual practitioner.\n(3)  Nothing in this section compels the production by an accounting entity or its individual practitioner of a record or document containing a privileged communication by or to a legal practitioner in that capacity.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38F. Duties and powers of entity revie...",
    "content_length": 2445,
    "created_at": "2025-03-31T07:36:01.679370",
    "updated_at": "2025-03-31T07:36:21.691167",
    "file_path": "unknown_source"
  },
  "doc-ab403d3e35b4bf54a9caec6004c962fd": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38G. Submission of report to Registrar, etc.\n        Section Content: 38G\\. —(1)  An entity reviewer who carries out a quality control standards review or an AML/CFT requirements review must submit —\n(a)\na report to the Registrar at the conclusion of the quality control standards review or the AML/CFT requirements review; and\n(b)\nany interim report that the Registrar may require.\n(2)  The Registrar must submit a report to the Oversight Committee if —\n(a)\nfollowing a quality control standards review and after considering the entity reviewer’s report submitted under subsection (1), the Registrar is of the opinion that —\n(i)\nthe accounting entity’s compliance with any of the quality control standards is partially satisfactory under the Oversight Committee’s quality control standards assessment framework; or\n(ii)\nthe accounting entity’s compliance with any of the quality control standards is not satisfactory under the Oversight Committee’s quality control standards assessment framework; or\n(b)\nfollowing an AML/CFT requirements review and after considering the entity reviewer’s report submitted under subsection (1), the Registrar is of the opinion that the accounting entity or any of its individual practitioners has breached any of the AML/CFT requirements.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38G. Submission of report to Registrar...",
    "content_length": 1334,
    "created_at": "2025-03-31T07:36:21.835888",
    "updated_at": "2025-03-31T07:36:42.083835",
    "file_path": "unknown_source"
  },
  "doc-fe6235ebdf289a764e8951eeb09fa591": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38H. Where compliance by accounting entity with quality control standards is partially satisfactory or not satisfactory\n        Section Content: 38H\\. —(1)  Where the Oversight Committee, after considering the Registrar’s report submitted under section 38G(2)(a), is satisfied that the accounting entity’s compliance with any of the quality control standards is partially satisfactory under the Oversight Committee’s quality control standards assessment framework, the Oversight Committee may make one or more of the following orders:\n(a)\nan order requiring the accounting entity to undergo and satisfactorily complete any remedial programme specified or approved by the Oversight Committee in relation to the accounting entity’s compliance with the quality control standards;\n(b)\nan order requiring the accounting entity to take any other steps specified by the Oversight Committee to improve the accounting entity’s compliance with the quality control standards;\n(c)\nan order requiring the accounting entity to give any undertaking in relation to its compliance with the quality control standards that the Oversight Committee thinks fit;\n(d)\nany other order to improve the accounting entity’s compliance with the quality control standards that the Oversight Committee thinks necessary or expedient.\n(2)  Where the Oversight Committee, after considering the Registrar’s report submitted under section 38G(2)(a), is satisfied that the accounting entity’s compliance with any of the quality control standards is not satisfactory under the Oversight Committee’s quality control standards assessment framework, the Oversight Committee may —\n(a)\nmake any of the following orders:\n(i)\nan order revoking the approval granted to the accounting entity as an accounting entity under Part 4;\n(ii)\nan order suspending the accounting entity from providing public accountancy services for a period not exceeding 2 years;\n(b)\nin lieu of an order in paragraph (a)(i) or (ii), or in addition to an order in paragraph (a)(ii), make one or more of the following orders:\n(i)\nan order restricting the provision of public accountancy services by the accounting entity in the manner that the Oversight Committee thinks fit for a period not exceeding 2 years;\n(ii)\nan order imposing on the accounting entity a penalty not exceeding the lower of the following:\n(A)\n$250,000;\n(B)\n5% of the accounting entity’s audit turnover during the period of 12 months ending on the last day of its financial year immediately before the start of the quality control standards review;\n(iii)\nan order requiring the accounting entity to undergo and satisfactorily complete any remedial programme specified or approved by the Oversight Committee in relation to the accounting entity’s compliance with the quality control standards;\n(iv)\nan order requiring the accounting entity to take any other steps specified by the Oversight Committee to improve the accounting entity’s compliance with the quality control standards;\n(v)\nan order requiring the accounting entity to give any undertaking in relation to its compliance with the quality control standards that the Oversight Committee thinks fit;\n(vi)\nany other order to improve the accounting entity’s compliance with the quality control standards that the Oversight Committee thinks necessary or expedient.\n(3)  Where the Oversight Committee has made an order under subsection (1), the Oversight Committee may, having regard to any change in circumstances or for other good reason —\n(a)\nrevoke the order and make any one or more different orders under subsection (1); or\n(b)\nvary the order and make any one or more different orders under subsection (1) in addition to that order.\n(4)  Where the Oversight Committee has made an order under subsection (2)(b), the Oversight Committee may, having regard to any change in circumstances or for other good reason —\n(a)\nrevoke the order and make any one or more different orders under subsection (2)(b); or\n(b)\nvary the order and make any one or more different orders under subsection (2)(b) in addition to that order.\n(5)  Where the Oversight Committee is satisfied that an accounting entity has breached any order made under subsection (1), the Oversight Committee may make any of the following orders:\n(a)\nan order revoking the approval granted to the accounting entity as an accounting entity under Part 4;\n(b)\nan order suspending the accounting entity from providing public accountancy services for a period not exceeding 2 years;\n(c)\nan order imposing on the accounting entity a penalty not exceeding the lower of the following:\n(i)\n$250,000;\n(ii)\n5% of the accounting entity’s audit turnover during the period of 12 months ending on the last day of its financial year immediately before the start of the quality control standards review.\n(6)  Where the Oversight Committee is satisfied that an accounting entity has breached any order made under subsection (2)(b)(i), (iii), (iv), (v) or (vi) (where the order was not made together with an order under subsection (2)(b)(ii)), the Oversight Committee may make any of the following orders:\n(a)\nan order revoking the approval granted to the accounting entity as an accounting entity under Part 4;\n(b)\nan order suspending the accounting entity from providing public accountancy services for a period not exceeding 2 years;\n(c)\nan order imposing on the accounting entity a penalty not exceeding the lower of the following:\n(i)\n$250,000;\n(ii)\n5% of the accounting entity’s audit turnover during the period of 12 months ending on the last day of its financial year immediately before the start of the quality control standards review.\n(7)  Where the Oversight Committee is satisfied that an accounting entity has breached any order made under subsection (2)(b)(i), (iii), (iv), (v) or (vi) (where the order was made together with an order under subsection (2)(b)(ii)), the Oversight Committee may make any of the following orders:\n(a)\nan order revoking the approval granted to the accounting entity as an accounting entity under Part 4;\n(b)\nan order suspending the accounting entity from providing public accountancy services for a period not exceeding 2 years.\n(8)  Where the Oversight Committee makes an order to suspend the accounting entity from providing public accountancy services under subsection (5)(b), (6)(b) or (7)(b), the Oversight Committee may —\n(a)\nin the case of an order under subsection (5)(b) — also make one or more of the following orders:\n(i)\nan order imposing on the accounting entity a penalty not exceeding the lower of the following:\n(A)\n$250,000;\n(B)\n5% of the accounting entity’s audit turnover during the period of 12 months ending on the last day of its financial year immediately before the start of the quality control standards review;\n(ii)\none or more orders under subsection (1);\n(b)\nin the case of an order under subsection (6)(b) — also make one or more orders under subsection (2)(b); or\n(c)\nin the case of an order under subsection (7)(b) — also make one or more orders under subsection (2)(b)(i), (iii), (iv), (v) or (vi).\n(9)  Any penalty imposed by an order made under this section is recoverable as a debt due to the Authority from the accounting entity.\n(10)  Without affecting subsection (9), where an accounting entity is ordered to pay a penalty under this section but fails to pay the penalty by the date the order takes effect under subsection (13), the Oversight Committee may, if it thinks fit, make an order to —\n(a)\nrevoke the approval granted to the accounting entity as an accounting entity under Part 4; or\n(b)\nsuspend the accounting entity from providing public accountancy services for a period not exceeding 12 months.\n(11)  The Registrar must serve a copy of every order made under subsection (1), (2), (3), (4), (5), (6), (7), (8) or (10) on the accounting entity concerned.\n(12)  The Oversight Committee must not make an order under this section to —\n(a)\nrevoke the approval granted to an accounting entity as an accounting entity under Part 4;\n(b)\nsuspend an accounting entity from providing public accountancy services (including any order under subsection (8)(a), (b) or (c)); or\n(c)\nimpose on an accounting entity a penalty,\nunless the Oversight Committee has given the accounting entity an opportunity to show cause against the proposed order.\n(13)  An order made by the Oversight Committee under this section to —\n(a)\nrevoke the approval granted to an accounting entity as an accounting entity under Part 4;\n(b)\nsuspend an accounting entity from providing public accountancy services (including any order under subsection (8)(a), (b) or (c)); or\n(c)\nimpose on an accounting entity a penalty,\ndoes not take effect until the latest of the following:\n(d)\none month after the date the order has been served on the accounting entity;\n(e)\nthe date specified by the Oversight Committee in the order as the date on which the order takes effect;\n(f)\nwhere an appeal against the order is made to the General Division of the High Court under subsection (14), the date immediately after the date the appeal has been determined or withdrawn.\n(14)  Any accounting entity that is aggrieved by an order of the Oversight Committee under this section to —\n(a)\nrevoke the approval granted to the accounting entity as an accounting entity under Part 4;\n(b)\nsuspend the accounting entity from providing public accountancy services (including any order under subsection (8)(a), (b) or (c)); or\n(c)\nimpose on the accounting entity a penalty,\nmay appeal to the General Division of the High Court within a period of 30 days or within any further period that the General Division of the High Court may allow, after the order of the Oversight Committee has been served on the accounting entity.\n(15)  The decision of the General Division of the High Court on an appeal under subsection (14) is final.\n(16)  In this section, “audit turnover” means the gross revenue derived by an accounting entity from the audit and reporting on financial statements.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38H. Where compliance by accounting en...",
    "content_length": 10056,
    "created_at": "2025-03-31T07:36:42.241425",
    "updated_at": "2025-03-31T07:37:13.567684",
    "file_path": "unknown_source"
  },
  "doc-ee551d4f23bc7a380efb7f855a491a09": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38I. Non-compliance by accounting entity with AML/CFT requirements\n        Section Content: 38I\\. —(1)  Where the Oversight Committee, after considering the Registrar’s report submitted under section 38G(2)(b), is satisfied that the accounting entity has not complied with any of the AML/CFT requirements, the Oversight Committee may —\n(a)\nmake any of the following orders:\n(i)\nan order revoking the approval granted to the accounting entity as an accounting entity under Part 4;\n(ii)\nan order suspending the accounting entity from providing public accountancy services for a period not exceeding 12 months;\n(b)\nin lieu of an order in paragraph (a)(i) or (ii), or in addition to an order in paragraph (a)(ii), make one or more of the following orders:\n(i)\nan order restricting the provision of public accountancy services by the accounting entity in the manner that the Oversight Committee thinks fit for a period not exceeding 12 months;\n(ii)\nan order imposing on the accounting entity a penalty not exceeding $25,000 for each breach of the AML/CFT requirements;\n(iii)\nan order censuring the accounting entity.\n(2)  Where the Oversight Committee has made an order under subsection (1)(b), the Oversight Committee may, having regard to any change in circumstances or for other good reason —\n(a)\nrevoke the order and make any one or more different orders under subsection (1)(b); or\n(b)\nvary the order and make any one or more different orders under subsection (1)(b) in addition to that order.\n(3)  Where the Oversight Committee is satisfied that an accounting entity has breached an order made under subsection (1)(b)(i), the Oversight Committee may make any of the following orders:\n(a)\nan order revoking the approval granted to the accounting entity as an accounting entity under Part 4;\n(b)\nan order suspending the accounting entity from providing public accountancy services for a period not exceeding 12 months.\n(4)  Where the Oversight Committee makes an order to suspend the accounting entity from providing public accountancy services under subsection (3)(b), the Oversight Committee may also make one or more orders under subsection (1)(b)(i) or (iii).\n(5)  Any penalty imposed by an order made under this section is recoverable as a debt due to the Authority from the accounting entity.\n(6)  Without affecting subsection (5), where an accounting entity is ordered to pay a penalty under this section but fails to pay the penalty by the date the order takes effect under subsection (9), the Oversight Committee may, if it thinks fit, make an order to —\n(a)\nrevoke the approval granted to the accounting entity as an accounting entity under Part 4; or\n(b)\nsuspend the accounting entity from providing public accountancy services for a period not exceeding 12 months.\n(7)  The Registrar must serve a copy of every order made under subsection (1), (2), (3), (4) or (6) on the accounting entity concerned.\n(8)  The Oversight Committee must not make an order under this section to —\n(a)\nrevoke the approval granted to an accounting entity as an accounting entity under Part 4;\n(b)\nsuspend an accounting entity from providing public accountancy services (including any order under subsection (4)); or\n(c)\nimpose on an accounting entity a penalty,\nunless the Oversight Committee has given the accounting entity an opportunity to show cause against the proposed order.\n(9)  An order made by the Oversight Committee under this section to —\n(a)\nrevoke the approval granted to an accounting entity as an accounting entity under Part 4;\n(b)\nsuspend an accounting entity from providing public accountancy services (including any order under subsection (4)); or\n(c)\nimpose on an accounting entity a penalty,\ndoes not take effect until the latest of the following:\n(d)\none month after the date the order has been served on the accounting entity;\n(e)\nthe date specified by the Oversight Committee in the order as the date on which the order takes effect;\n(f)\nwhere an appeal against the order is made to the General Division of the High Court under subsection (10), the date immediately after the date the appeal has been determined or withdrawn.\n(10)  Any accounting entity that is aggrieved by an order of the Oversight Committee under this section to —\n(a)\nrevoke the approval granted to the accounting entity as an accounting entity under Part 4;\n(b)\nsuspend the accounting entity from providing public accountancy services (including any order under subsection (4)); or\n(c)\nimpose on the accounting entity a penalty,\nmay appeal to the General Division of the High Court within a period of 30 days or within any further period that the General Division of the High Court may allow, after the order of the Oversight Committee has been served on the accounting entity.\n(11)  The decision of the General Division of the High Court on an appeal under subsection (10) is final.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38I. Non-compliance by accounting enti...",
    "content_length": 4932,
    "created_at": "2025-03-31T07:37:13.729382",
    "updated_at": "2025-03-31T07:37:34.823767",
    "file_path": "unknown_source"
  },
  "doc-4bd2e8b298c73e0de44a90eab3d1c430": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38J. Non-compliance by individual practitioner of accounting entity with AML/CFT requirements\n        Section Content: 38J\\. —(1)  Where the Oversight Committee, after considering the Registrar’s report submitted under section 38G(2)(b), is satisfied that any individual practitioner of an accounting entity has not complied with any of the AML/CFT requirements, the Oversight Committee may —\n(a)\nmake any of the following orders:\n(i)\nan order cancelling the individual practitioner’s registration;\n(ii)\nan order suspending the individual practitioner’s registration for a period not exceeding 12 months;\n(b)\nin lieu of an order in paragraph (a)(i) or (ii), or in addition to an order in paragraph (a)(ii), make one or more of the following orders:\n(i)\nan order restricting the provision of public accountancy services by the individual practitioner in the manner that the Oversight Committee thinks fit for a period not exceeding 12 months;\n(ii)\nan order imposing on the individual practitioner a penalty not exceeding $10,000 for each breach of the AML/CFT requirements;\n(iii)\nan order censuring the individual practitioner.\n(2)  Where the Oversight Committee has made an order under subsection (1)(b), the Oversight Committee may, having regard to any change in circumstances or for other good reason —\n(a)\nrevoke the order and make any one or more different orders under subsection (1)(b); or\n(b)\nvary the order and make any one or more different orders under subsection (1)(b) in addition to that order.\n(3)  Where the Oversight Committee is satisfied that the individual practitioner has breached an order made under subsection (1)(b)(i), the Oversight Committee may make any of the following orders:\n(a)\nan order cancelling the individual practitioner’s registration;\n(b)\nan order suspending the individual practitioner’s registration for a period not exceeding 12 months.\n(4)  Where the Oversight Committee makes an order to suspend the individual practitioner’s registration under subsection (3)(b), the Oversight Committee may also make one or more orders under subsection (1)(b)(i) or (iii).\n(5)  Any penalty imposed by an order made under this section is recoverable as a debt due to the Authority from the individual practitioner.\n(6)  Without affecting subsection (5), where an individual practitioner is ordered to pay a penalty under this section but fails to pay the penalty by the date the order takes effect under subsection (9), the Oversight Committee may, if it thinks fit, make an order to —\n(a)\ncancel the individual practitioner’s registration; or\n(b)\nsuspend the individual practitioner’s registration for a period not exceeding 12 months.\n(7)  The Registrar must serve a copy of every order made under subsection (1), (2), (3), (4) or (6) on the individual practitioner concerned.\n(8)  The Oversight Committee must not make an order under this section to —\n(a)\ncancel an individual practitioner’s registration;\n(b)\nsuspend an individual practitioner’s registration (including any order under subsection (4)); or\n(c)\nimpose on an individual practitioner a penalty,\nunless the Oversight Committee has given the individual practitioner an opportunity to show cause against the proposed order.\n(9)  An order made by the Oversight Committee under this section to —\n(a)\ncancel an individual practitioner’s registration;\n(b)\nsuspend an individual practitioner’s registration (including any order under subsection (4)); or\n(c)\nimpose on an individual practitioner a penalty,\ndoes not take effect until the latest of the following:\n(d)\none month after the date the order has been served on the individual practitioner;\n(e)\nthe date specified by the Oversight Committee in the order as the date on which the order takes effect;\n(f)\nwhere an appeal against the order is made to the General Division of the High Court under subsection (10), the date immediately after the date the appeal has been determined or withdrawn.\n(10)  Any individual practitioner who is aggrieved by an order of the Oversight Committee under this section to —\n(a)\ncancel the individual practitioner’s registration;\n(b)\nsuspend the individual practitioner’s registration (including any order under subsection (4)); or\n(c)\nimpose on the individual practitioner a penalty,\nmay appeal to the General Division of the High Court within a period of 30 days or within any further period that the General Division of the High Court may allow, after the order of the Oversight Committee has been served on the individual practitioner.\n(11)  The decision of the General Division of the High Court on an appeal under subsection (10) is final.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38J. Non-compliance by individual prac...",
    "content_length": 4683,
    "created_at": "2025-03-31T07:37:34.997035",
    "updated_at": "2025-03-31T07:37:54.712253",
    "file_path": "unknown_source"
  },
  "doc-3b49c606142fb72f7d0e6475707e21d3": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38K. Refusal to undergo quality control standards review or AML/CFT requirements review\n        Section Content: 38K\\. —(1)  If an accounting entity refuses, without reasonable excuse (the burden of proof of which lies with the accounting entity), to undergo a quality control standards review or an AML/CFT requirements review as required by the Oversight Committee, the Oversight Committee may by order suspend the accounting entity from providing public accountancy services for a period not exceeding 2 years.\n(2)  If —\n(a)\nan individual practitioner of an accounting entity refuses to undergo an AML/CFT requirements review; and\n(b)\nit is proved that his or her refusal was with the consent or connivance or was attributable to any neglect on the part of the accounting entity,\nthe individual practitioner’s refusal is to be treated as a refusal by the accounting entity to undergo an AML/CFT requirements review under subsection (1).\n(3)  An order of the Oversight Committee under subsection (1) does not take effect until the latest of the following:\n(a)\none month after the date the order has been served on the accounting entity;\n(b)\nthe date specified by the Oversight Committee in the order as the date on which the order takes effect;\n(c)\nwhere an appeal against the order is made to the General Division of the High Court under subsection (4), the date immediately after the date the appeal has been determined or withdrawn.\n(4)  Any accounting entity that is aggrieved by an order of the Oversight Committee under subsection (1) may appeal to the General Division of the High Court within a period of 30 days or within any further period that the General Division of the High Court may allow, after the order of the Oversight Committee has been served on the accounting entity.\n(5)  The decision of the General Division of the High Court on an appeal under subsection (4) is final.\n(6)  In this section, without limiting the expression, an accounting entity refuses to undergo a quality control standards review or an AML/CFT requirements review if the accounting entity —\n(a)\nexpressly informs an entity reviewer, the Oversight Committee or the Authority that the accounting entity refuses to undergo the quality control standards review or the AML/CFT requirements review;\n(b)\nrefuses to permit an entity reviewer to enter, at any reasonable hours in the day for the purposes of carrying out the quality control standards review or the AML/CFT requirements review, its registered office or business premises;\n(c)\nrefuses to comply with a requirement of an entity reviewer made under section 38F(1)(a) or (b) within 14 days after the notice of the requirement has been served on the accounting entity;\n(d)\nrefuses to permit an entity reviewer to inspect, examine or make copies of or take any abstract of or extract from any record or document produced under section 38F(1)(a) or (b); or\n(e)\nrefuses, where a written notice requiring the accounting entity to undergo the quality control standards review or the AML/CFT requirements review has been served on the accounting entity under section 38D(3)(a), to respond to the notice within 14 days after the date the notice has been served or any longer period that the entity reviewer, the Oversight Committee or the Authority may allow.\n(7)  In this section, without limiting the expression, an individual practitioner of an accounting entity refuses to undergo an AML/CFT requirements review if the individual practitioner —\n(a)\nexpressly informs an entity reviewer, the Oversight Committee or the Authority that the individual practitioner refuses to undergo the AML/CFT requirements review;\n(b)\nrefuses to permit an entity reviewer to enter, at any reasonable hours in the day for the purposes of carrying out the AML/CFT requirements review on the individual practitioner, the registered office or business premises of the accounting entity in which the individual practitioner practises as a public accountant;\n(c)\nrefuses to comply with a requirement of an entity reviewer made under section 38F(1)(a) or (b) (as applied by section 38F(2)) within 14 days after the notice has been served on the individual practitioner;\n(d)\nrefuses to permit an entity reviewer to inspect, examine or make copies of or take any abstract of or extract from any record or document produced under section 38F(1)(a) or (b) (as applied by section 38F(2)); or\n(e)\nrefuses, where a written notice requiring the individual practitioner to undergo the AML/CFT requirements review has been served on him or her under section 38D(4)(a), to respond to the notice within 14 days after the date the notice has been served or any longer period that the entity reviewer, the Oversight Committee or the Authority may allow.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 38K. Refusal to undergo quality contro...",
    "content_length": 4821,
    "created_at": "2025-03-31T07:37:54.878689",
    "updated_at": "2025-03-31T07:38:17.137957",
    "file_path": "unknown_source"
  },
  "doc-ef34b2dad68240328c70e9fcf0c585cb": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 39. Appointment of Complaints and Disciplinary Panel\n        Section Content: 39\\. —(1)  For the purpose of enabling Complaints Committees and Disciplinary Committees to be constituted under this Part, the Oversight Committee must appoint a panel, to be known as the Complaints and Disciplinary Panel, consisting of such number of public accountants and lay persons as the Oversight Committee thinks fit.\n(2)  A member of the Complaints and Disciplinary Panel is appointed for a term of 2 years and is eligible for re‑appointment.\n(3)  The Registrar is the Chairperson of the Complaints and Disciplinary Panel.\n(4)  The Oversight Committee may at any time remove from office any member of the Complaints and Disciplinary Panel or fill any vacancy in its membership.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 39. Appointment of Complaints and Disc...",
    "content_length": 827,
    "created_at": "2025-03-31T07:38:17.309473",
    "updated_at": "2025-03-31T07:38:38.741388",
    "file_path": "unknown_source"
  },
  "doc-1c59bdf15ce92144721cf434a420ae2a": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 4. Appointment of Public Accountants Oversight Committee\n        Section Content: 4\\. —(1)  For the discharge of its functions under section 3, the Authority may, with the approval of the Minister and subject to subsections (2) and (2A), appoint from among its members or from among other persons a committee to be known as the Public Accountants Oversight Committee.\n(2)  At least one member of the Oversight Committee must be a public accountant.\n(2A)  At least 3 members of the Oversight Committee must be members of the Authority.\n(3)  The Oversight Committee must carry out the functions and duties and exercise the powers conferred on it by this Act in accordance with any general or special directions that the Authority may give to the Oversight Committee.\n(4)  The First Schedule has effect with respect to the Oversight Committee, its members and proceedings.\n(5)  [\nDeleted by Act 32 of 2022 wef 01/07/2023\n]\n(6)  For the purposes of the Accounting and Corporate Regulatory Authority Act 2004, a member of the Oversight Committee is deemed to be a member of a committee of the Authority.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 4. Appointment of Public Accountants O...",
    "content_length": 1160,
    "created_at": "2025-03-31T07:38:38.914583",
    "updated_at": "2025-03-31T07:38:55.628859",
    "file_path": "unknown_source"
  },
  "doc-62a6e4e540ed4522ffc90b81e0e8c2ac": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 40. Complaints against public accountants, accounting corporations, accounting firms and accounting LLPs\n        Section Content: 40\\. —(1)  Any complaint concerning —\n(a)\nany improper or dishonourable conduct on the part of a public accountant in the discharge of his or her professional duty; or\n(b)\nany improper act or conduct on the part of a public accountant, an accounting corporation, an accounting firm or an accounting LLP,\nmust be made to the Oversight Committee in writing and must be supported by such statutory declaration as the Oversight Committee may require, except that no statutory declaration is required if the complaint or information is made or given by any public officer or officer of the Authority.\n(2)  The Oversight Committee may require any person making a complaint to deposit with it a reasonable sum not exceeding $1,000 to cover the costs and expenses that may necessarily be incurred by the Oversight Committee in dealing with the complaint.\n(3)  Where the complaint is dismissed under section 41(6) or is otherwise found to be frivolous or vexatious following a review or inquiry under this Part, the sum so deposited or such part of the sum as the Oversight Committee may determine is to be applied for the payment of those costs and expenses; otherwise the sum so deposited must be returned to the person making the complaint.\n(4)  Any person who makes a complaint to the Oversight Committee under this Part which the person knows to be false in any material particular shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 40. Complaints against public accounta...",
    "content_length": 1665,
    "created_at": "2025-03-31T07:38:55.799129",
    "updated_at": "2025-03-31T07:39:19.996430",
    "file_path": "unknown_source"
  },
  "doc-b572ea0746c29a6a30f924fa224fb19d": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 41. Review of complaint\n        Section Content: 41\\. —(1)  Subject to subsection (2), the Oversight Committee must, upon receiving any complaint under section 40, refer the complaint to the Registrar for review.\n(2)  The Oversight Committee may also, on its own motion, refer any information concerning any improper or dishonourable act or conduct of a public accountant, an accounting corporation, an accounting firm or an accounting LLP to the Registrar for review.\n(3)  The Oversight Committee need not refer any complaint or information to the Registrar for review where the complaint or information relates to any matter set out in section 15(1) or (4) or 31(1), (2) or (5), and in such a case, the Oversight Committee may take such action as it thinks fit under that section.\n(4)  The Registrar —\n(a)\nmust review the complaint or information referred to him or her for the purpose of determining if there are sufficient merits in the complaint or information to warrant the institution of disciplinary proceedings under this Part against the public accountant, accounting corporation, accounting firm or accounting LLP concerned; and\n(b)\nmay, for the purpose of conducting such review, enlist the assistance of any public accountant or lay person on the Complaints and Disciplinary Panel.\n(5)  In reviewing any complaint or information under this section, the Registrar may require the complainant (if any) or the public accountant, accounting corporation, accounting firm or accounting LLP concerned to answer any question or to provide any document or information that the Registrar considers relevant for the purpose of the review.\n(6)  If the complainant refuses or fails, without reasonable excuse, to provide any document or information as may be required by the Registrar under subsection (5), the Registrar may dismiss the complaint.\n(7)  If any public accountant, accounting corporation, accounting firm or accounting LLP refuses or fails, without reasonable excuse, to provide any document or information as may be required by the Registrar under subsection (5), the public accountant, accounting corporation or accounting firm (as the case may be) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $2,000.\n(8)  On the completion of a review under this section, the Registrar must —\n(a)\ndismiss the complaint or information, if he or she finds that the complaint is frivolous, vexatious, misconceived or without merits, or that the information is unsubstantiated;\n(b)\nin a case where the complaint or information relates to the conviction (whether in Singapore or elsewhere) of the public accountant, accounting corporation, accounting firm or accounting LLP concerned of an offence that —\n(i)\ninvolves fraud or dishonesty; or\n(ii)\nimplies a defect in character which makes the public accountant concerned unfit for his or her profession,\nrecommend to the Oversight Committee to refer the matter to a Disciplinary Committee for a formal inquiry; and\n(c)\nin any other case, recommend to the Oversight Committee to refer the matter to a Complaints Committee for inquiry.\n(9)  The Oversight Committee may, upon accepting the recommendation of the Registrar under subsection (8)(b) or (c) —\n(a)\ndirect the Registrar to appoint a Complaints Committee; or\n(b)\nappoint a Disciplinary Committee,\nas appropriate, and refer the complaint or information thereto for an inquiry or a formal hearing, as the case may be.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 41. Review of complaint\n        Sectio...",
    "content_length": 3523,
    "created_at": "2025-03-31T07:39:20.168950",
    "updated_at": "2025-03-31T07:39:49.017708",
    "file_path": "unknown_source"
  },
  "doc-b6a8ea437a12218e82e64430baea0b69": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 42. Power to proceed with complaint despite complainant’s withdrawal\n        Section Content: 42\\. —(1)  The Oversight Committee may direct that a complaint against a public accountant, an accounting corporation, an accounting firm or an accounting LLP be proceeded with at an inquiry of a Complaints Committee or a formal inquiry of a Disciplinary Committee even though the complainant may have withdrawn the complaint at any time before or after the appointment of the Complaints Committee or Disciplinary Committee.\n(2)  Where the Oversight Committee has made a direction under subsection (1), the complaint must be proceeded with as if it had originated as information which the Oversight Committee had, on its own motion, referred to the Registrar for review under section 41(2).",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 42. Power to proceed with complaint de...",
    "content_length": 846,
    "created_at": "2025-03-31T07:39:49.198520",
    "updated_at": "2025-03-31T07:40:04.586274",
    "file_path": "unknown_source"
  },
  "doc-5d7aa1325221f0ed42eb546f1fd4b240": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 43. Conviction final and conclusive\n        Section Content: 43\\. In any proceedings instituted under this Part against a public accountant, an accounting corporation, an accounting firm or an accounting LLP arising from his, her or its conviction of a criminal offence, the Registrar, the Oversight Committee, a Complaints Committee, a Disciplinary Committee and the General Division of the High Court on appeal from any order of the Oversight Committee, is to accept the conviction as final and conclusive unless —\n(a)\nit is subject to review or appeal that has not yet been determined;\n(b)\nit has been quashed or set aside; or\n(c)\na pardon has been given in respect of it.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 43. Conviction final and conclusive\n  ...",
    "content_length": 737,
    "created_at": "2025-03-31T07:40:04.767437",
    "updated_at": "2025-03-31T07:40:29.592766",
    "file_path": "unknown_source"
  },
  "doc-a54530cca67c4c117d385cf34059c813": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 44. Constitution of Complaints Committee\n        Section Content: 44\\. —(1)  A Complaints Committee consists of the following members, all of whom are to be appointed from the Complaints and Disciplinary Panel:\n(a)\n3 public accountants; and\n(b)\none lay person.\n(2)  The Registrar must designate one member of the Complaints Committee who is a public accountant to be its chairperson.\n(3)  A Complaints Committee may be appointed in connection with one or more matters or for a fixed period of time, as the Registrar thinks fit.\n(4)  The Registrar may at any time remove the chairperson or any member of a Complaints Committee or fill any vacancy in a Complaints Committee.\n(5)  No act done by or under the authority of a Complaints Committee is invalid in consequence of any defect that is subsequently discovered in the appointment or qualification of the chairperson or members or any of them.\n(6)  A member of a Complaints Committee, even though he or she has ceased to be a member of the Complaints and Disciplinary Panel on the expiry of his or her term of office, continues to be a member of the Complaints Committee until such time as the Complaints Committee has completed its work.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 44. Constitution of Complaints Committ...",
    "content_length": 1252,
    "created_at": "2025-03-31T07:40:29.778560",
    "updated_at": "2025-03-31T07:40:45.694529",
    "file_path": "unknown_source"
  },
  "doc-0eeb1b7e3b7b66977707fc3ef60a670e": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 45. Proceedings of Complaints Committee\n        Section Content: 45\\. —(1)  A Complaints Committee may meet from time to time for the purposes of its inquiry and may regulate its own procedure.\n(2)  The chairperson of a Complaints Committee may at any time summon a meeting of the Complaints Committee.\n(3)  The quorum for a meeting of the Complaints Committee is constituted by the following persons:\n(a)\nits chairperson;\n(b)\none member who is a public accountant; and\n(c)\none member who is a lay person.\n(4)  Any resolution or decision in writing signed by the chairperson and all the members of a Complaints Committee is as valid and effectual as if it had been made or reached at a meeting of the Complaints Committee where the chairperson and all its members were present.\n(5)  Any question arising at a meeting of the Complaints Committee is to be determined by a majority of votes and, in the case of an equality of votes, the chairperson has a casting vote.\n(6)  Where a Complaints Committee is of the opinion that a public accountant, an accounting corporation, an accounting firm or an accounting LLP should be called upon to answer any allegation made against him, her or it, the chairperson of the Complaints Committee must serve on the public accountant, accounting corporation, accounting firm or accounting LLP —\n(a)\ncopies of the complaint or information against him, her or it and any statutory declaration or affidavit that has been made in support of the complaint or information; and\n(b)\na notice inviting the public accountant, accounting corporation, accounting firm or accounting LLP, within such period (not being less than 14 days) as may be specified in the notice, to give to the Complaints Committee any written explanation he, she or it may wish to offer.\n(7)  The public accountant, accounting corporation, accounting firm or accounting LLP concerned does not have the right to be heard by the Complaints Committee, whether in person or by counsel, unless the Complaints Committee in its absolute discretion otherwise allows.\n(8)  A Complaints Committee must inquire into the complaint or information and complete its inquiry not later than 3 months from the date the complaint or information is referred to it.\n(9)  Where a Complaints Committee is of the opinion that it will not be able to complete its inquiry within the period specified in subsection (8) due to the complexity of the matter or serious difficulties encountered by the Complaints Committee in conducting its inquiry, the Complaints Committee may apply in writing to the Oversight Committee for an extension of time to complete its inquiry and the Oversight Committee may grant such extension of time to the Complaints Committee as it thinks fit.\n(10)  All information, including any book, document, paper or other records used by a Complaints Committee in the course of its deliberations, is confidential and must not be disclosed to any person including the public accountant, accounting corporation, accounting firm or accounting LLP concerned unless the Complaints Committee in its discretion decides otherwise.\n(11)  The chairperson of the Complaints Committee must record its proceedings in writing and in sufficient detail to enable the Oversight Committee to follow the course of the proceedings.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 45. Proceedings of Complaints Committe...",
    "content_length": 3364,
    "created_at": "2025-03-31T07:40:45.879724",
    "updated_at": "2025-03-31T07:41:13.147563",
    "file_path": "unknown_source"
  },
  "doc-fdb6f5ecf398b1c7a39617131fd0e2ee": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 46. Powers of Complaints Committee\n        Section Content: 46\\. —(1)  For the purposes of any inquiry, a Complaints Committee may —\n(a)\ncall upon or appoint any person the Complaints Committee considers necessary to assist it in its inquiry;\n(b)\nrequire any person —\n(i)\nto produce any book, document, paper or other record which may be related to or be connected with the subject matter of the inquiry for inspection by the Complaints Committee or the person appointed under paragraph (a) and for making copies thereof; or\n(ii)\nto give all information in relation to any such book, document, paper or other record which may be reasonably required by the Complaints Committee or the person so appointed; and\n(c)\nrequire any person to attend at a specified time and place and give evidence or produce any such book, document, paper or record.\n(2)  Any person who, without lawful excuse, refuses or fails to comply with any requirement of the Complaints Committee under subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 12 months or to both and, in the case of a continuing offence, to a further fine not exceeding $50 for every day or part of a day during which the offence continues after conviction.\n(3)  Where in the course of its inquiry a Complaints Committee receives any information or evidence relating to the conduct of the public accountant, accounting corporation, accounting firm or accounting LLP concerned which may give rise to further proceedings under this Part, the Complaints Committee may, after giving notice to the public accountant, accounting corporation, accounting firm or accounting LLP concerned, decide on its own motion to inquire into that matter and report its findings to the Oversight Committee.\n(4)  Where in the course of its inquiry a Complaints Committee receives any information or evidence relating to the conduct of the public accountant, accounting corporation, accounting firm or accounting LLP concerned which discloses an offence under any written law, the Complaints Committee must record that information in its report to the Oversight Committee.\n(5)  The Oversight Committee may appoint a legal assessor to advise the Complaints Committee on any matter of law arising in the course of its inquiry.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 46. Powers of Complaints Committee\n   ...",
    "content_length": 2411,
    "created_at": "2025-03-31T07:41:13.335071",
    "updated_at": "2025-03-31T07:41:33.897348",
    "file_path": "unknown_source"
  },
  "doc-d4dbe4cf703857cf71a0e85d4c968267": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 47. Findings of Complaints Committee\n        Section Content: 47\\. Upon due inquiry into the complaint or information referred to it under this Part, a Complaints Committee must —\n(a)\nif it is of the view that no further action should be taken on the complaint or information, dismiss the complaint or information and notify the Oversight Committee, the complainant (if any) and the public accountant, accounting corporation, accounting firm or accounting LLP concerned of the dismissal;\n(b)\nif it is of the view that the complaint or information is valid but that no formal inquiry is necessary, recommend to the Oversight Committee to do any of the following:\n(i)\norder that the public accountant, accounting corporation, accounting firm or accounting LLP concerned be issued with a letter of advice;\n(ii)\norder that the public accountant, accounting corporation, accounting firm or accounting LLP concerned be warned;\n(iii)\nmake any other order that the Complaints Committee considers appropriate; and\n(c)\nif it is of the view that a formal inquiry is necessary, recommend to the Oversight Committee to constitute a Disciplinary Committee to hold the formal inquiry.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 47. Findings of Complaints Committee\n ...",
    "content_length": 1231,
    "created_at": "2025-03-31T07:41:34.095337",
    "updated_at": "2025-03-31T07:41:56.947564",
    "file_path": "unknown_source"
  },
  "doc-bc79211a684031ad48f73bd172a18970": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 48. Decision of Oversight Committee\n        Section Content: 48\\. —(1)  Upon receipt of the findings and recommendation of a Complaints Committee under section 47(b) or (c), the Oversight Committee may either —\n(a)\naccept the recommendation and make the recommended order;\n(b)\nrefer the matter back to the Complaints Committee for further inquiry; or\n(c)\nmake such other order as the Oversight Committee thinks fit.\n(2)  The Oversight Committee must notify the public accountant, accounting corporation, accounting firm or accounting LLP concerned and the person who made the complaint of the Oversight Committee’s decision.\n(3)  Any public accountant, accounting corporation, accounting firm or accounting LLP who or which is aggrieved by any order of the Oversight Committee, being an order referred to in subsection (1)(c) or section 47(b), may, within 30 days of being notified of the determination of the Oversight Committee, appeal to the Minister whose decision is final.\n(4)  The Minister may make —\n(a)\nan order affirming the decision of the Oversight Committee;\n(b)\nan order directing the Oversight Committee to constitute a Disciplinary Committee for a formal inquiry into the matter; or\n(c)\nsuch other order as he or she thinks fit.\n(5)  Where —\n(a)\nthe Oversight Committee accepts the recommendation of the Complaints Committee under section 47(c); or\n(b)\nthe Minister makes an order under subsection (4)(b),\nthe Oversight Committee must appoint a Disciplinary Committee to conduct the formal inquiry.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 48. Decision of Oversight Committee\n  ...",
    "content_length": 1576,
    "created_at": "2025-03-31T07:41:57.142524",
    "updated_at": "2025-03-31T07:42:17.665956",
    "file_path": "unknown_source"
  },
  "doc-6fd7fa78b79bfd9dc3d3bba69c77fb74": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 49. Constitution of Disciplinary Committee\n        Section Content: 49\\. —(1)  A Disciplinary Committee consists of —\n(a)\n4 public accountants; and\n(b)\none lay person.\n(2)  A Disciplinary Committee may be appointed in connection with one or more matters or for a fixed period of time, as the Oversight Committee thinks fit.\n(3)  The chairperson or a member of a Complaints Committee which inquired into any complaint or information must not be a member of a Disciplinary Committee conducting the formal inquiry into the same complaint or information.\n(4)  The Oversight Committee must appoint a member of a Disciplinary Committee who is a public accountant to be the chairperson of the Disciplinary Committee.\n(5)  The Oversight Committee may at any time revoke the appointment of any Disciplinary Committee or remove any member of a Disciplinary Committee or fill any vacancy in a Disciplinary Committee.\n(6)  No act done by or under the authority of a Disciplinary Committee is invalid in consequence of any defect that is subsequently discovered in the appointment or qualification of the members or any of them.\n(7)  A member of a Disciplinary Committee, even though he or she has ceased to be a member of the Complaints and Disciplinary Panel on the expiry of his or her term of office, continues to be a member of the Disciplinary Committee until such time as the Disciplinary Committee has completed its work.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 49. Constitution of Disciplinary Commi...",
    "content_length": 1478,
    "created_at": "2025-03-31T07:42:17.864025",
    "updated_at": "2025-03-31T07:42:36.279513",
    "file_path": "unknown_source"
  },
  "doc-6f0b3bcc2c2eed71549ed70fee8abad5": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 5. Functions and powers of Oversight Committee\n        Section Content: 5\\. —(1)  The Oversight Committee is to assist the Authority in the discharge of the Authority’s functions under section 3 and, in so doing, is to —\n(a)\nkeep and maintain —\n(i)\na Register of Public Accountants;\n(ii)\na Register of Public Accounting Corporations;\n(iii)\na Register of Public Accounting Firms;\n(iv)\na Register of Public Accounting Limited Liability Partnerships; and\n(v)\nany other registers that may be necessary for the purposes of this Act;\n(b)\nconsider and, as appropriate, grant (whether unconditionally or subject to such conditions as it thinks fit) or reject —\n(i)\nall applications for registration made under Part 3; and\n(ii)\nall applications for approval under Part 4;\n(c)\nassist the Authority in determining, prescribing and reviewing the requirements to be satisfied by individuals seeking to be registered as public accountants under Part 3;\n(d)\nconduct or arrange for the conduct of such examinations as it thinks necessary for the purposes of registering public accountants;\n(e)\nadminister the continuing professional education programmes for public accountants;\n(f)\nadminister the practice monitoring programmes under Part 5;\n(g)\nassist the Authority to determine, prescribe, issue, adopt and review —\n(i)\nthe requirements to be applied by public accountants, accounting corporations, accounting firms and accounting LLPs in relation to —\n(A)\nthe detection and prevention of money laundering or the financing of terrorism; and\n(B)\nthe recording and reporting of transactions suspected of involving money laundering or the financing of terrorism,\nincluding any requirement necessary or expedient to give effect to any recommendation issued or adopted by the intergovernmental body known as the Financial Action Task Force relating to the prevention of money laundering and the financing of terrorism;\n(ii)\nthe requirements in respect of professional conduct and ethics applicable to public accountants, accounting corporations, accounting firms and accounting LLPs when providing public accountancy services, other than the matters assigned to the Oversight Committee by the Authority and set out in the code of professional conduct and ethics prescribed by order under section 64AA(1)(a); and\n(iii)\nthe standards, methods, procedures and other requirements to be applied by public accountants, accounting corporations, accounting firms and accounting LLPs when providing public accountancy services, other than any standard, method, procedure or requirement which is of a class or description specified in the Second Schedule;\n(ga)\nadminister programmes to review the compliance by —\n(i)\naccounting corporations, accounting firms and accounting LLPs with the quality control standards as defined in section 38B; and\n(ii)\npublic accountants, accounting corporations, accounting firms and accounting LLPs with the requirements relating to the detection and prevention of money laundering and the financing of terrorism,\nin accordance with Part 5A;\n(h)\ninquire into —\n(i)\nany complaint against any public accountant, accounting corporation, accounting firm or accounting LLP; or\n(ii)\nany information relating to any professional misconduct on the part of any public accountant, accounting corporation, accounting firm or accounting LLP,\nand, if necessary, institute disciplinary proceedings in accordance with Part 6;\n(i)\nadvise the Authority on any matter which relates to the profession of public accountancy;\n(ia)\nprescribe the code of professional conduct and ethics applicable to public accountants, accounting corporations, accounting firms and accounting LLPs;\n(ib)\nprescribe any standard, method, procedure or other requirement which is of a class or description specified in the Second Schedule that is to be applied by public accountants, accounting corporations, accounting firms and accounting LLPs when providing public accountancy services; and\n(j)\ngenerally do all such acts, matters and things as are necessary to be carried out, or which the Oversight Committee is authorised to carry out, under this Act.\n(2)  The registers referred to in subsection (1)(a) may be kept in such form or manner as the Oversight Committee may determine.\n(3)  Subject to any general or special direction given by the Authority, the Oversight Committee has the power to do anything for the purpose of discharging its functions under this Act, or which is incidental or conducive to the discharge of those functions.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 5. Functions and powers of Oversight C...",
    "content_length": 4570,
    "created_at": "2025-03-31T07:42:36.475775",
    "updated_at": "2025-03-31T07:43:14.038217",
    "file_path": "unknown_source"
  },
  "doc-03211fbb115138f8e7c4a3cac0b368e8": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 50. Notice of formal inquiry\n        Section Content: 50\\. —(1)  Before a Disciplinary Committee commences a formal inquiry into any complaint or information referred to it, the Registrar must serve on the public accountant, accounting corporation, accounting firm or accounting LLP concerned a written notice of the formal inquiry.\n(2)  A formal inquiry must not be fixed on a date earlier than 14 days after the date of the notice of formal inquiry except with the agreement of the public accountant, accounting corporation, accounting firm or accounting LLP concerned.\n(3)  On application to the Disciplinary Committee, the public accountant, accounting corporation, accounting firm or accounting LLP concerned may request postponement of the formal inquiry, and the Disciplinary Committee may grant the application and postpone the formal inquiry to such date as it may determine, or refuse the application.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 50. Notice of formal inquiry\n        S...",
    "content_length": 973,
    "created_at": "2025-03-31T07:43:14.258896",
    "updated_at": "2025-03-31T07:43:33.078256",
    "file_path": "unknown_source"
  },
  "doc-5fb58c30261b688d739bf7bd1cc10893": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 51. Procedure of Disciplinary Committee\n        Section Content: 51\\. —(1)  A Disciplinary Committee is to meet at such times and places as its chairperson may appoint.\n(2)  All the members of a Disciplinary Committee must be personally present to constitute a quorum for a meeting of the Disciplinary Committee.\n(3)  All members of a Disciplinary Committee present at any meeting of the Disciplinary Committee must vote on any question arising at the meeting and such question is to be determined by a majority of votes and, in the case of an equality of votes, the chairperson has a casting vote.\n(4)  A Disciplinary Committee is not bound to act in any formal manner and is not bound by the provisions of the Evidence Act 1893 or by any other written law relating to evidence, but may inform itself on any matter in such manner as it thinks fit.\n(5)  The Oversight Committee may appoint an advocate and solicitor for the purpose of a formal inquiry (whether to prosecute the complaint or to act as a legal advisor to the Disciplinary Committee) and pay to the advocate and solicitor, as part of the expenses of the Oversight Committee, such remuneration as the Oversight Committee may determine.\n(6)  At the formal inquiry —\n(a)\na public accountant against whom the complaint has been made may appear in person or be represented by counsel; and\n(b)\nthe accounting corporation, accounting firm or accounting LLP against which the complaint has been made may be represented by any of its corporate practitioners or partners or be represented by counsel.\n(7)  If the public accountant, accounting corporation, accounting firm or accounting LLP concerned does not appear, the Disciplinary Committee may proceed with the formal inquiry after satisfying itself that the notice mentioned in section 50 was duly served on him, her or it.\n(8)  A Disciplinary Committee may, for the purposes of its formal inquiry, administer an oath or affirmation to any person giving evidence before it, and any party to the proceedings may take out subpoenas to testify or to produce documents.\n(9)  The subpoenas mentioned in subsection (8) must be served and may be enforced as if they were orders to attend court or orders to produce documents issued in connection with a civil action in the General Division of the High Court.\n(10)  Any person giving evidence before a Disciplinary Committee is legally bound to tell the truth.\n(11)  Persons giving evidence in a formal inquiry have the same privileges and immunities in relation to an inquiry as if it was a proceeding in a court of law.\n(12)  The hearing of a formal inquiry is not open to the public.\n(13)  A Disciplinary Committee must carry out its work expeditiously and may apply to the Oversight Committee for an extension of time and for directions to be given to the Disciplinary Committee if the Disciplinary Committee fails to make its finding and order within 6 months from the date of its appointment.\n(14)  When an application for an extension of time has been made under subsection (13), the Oversight Committee may grant an extension of time for such period as it thinks fit.\n(15)  The Oversight Committee may, where it thinks fit, require a Disciplinary Committee to consider further evidence and meet for that purpose except that the public accountant, accounting corporation, accounting firm or accounting LLP concerned must be given at least 14 days’ notice of the further meeting of the Disciplinary Committee.\n(16)  The chairperson of the Disciplinary Committee must record its proceedings in writing and in sufficient detail to enable the Oversight Committee to follow the course of the proceedings.\n(17)  In sections 172, 173, 174, 175, 177, 179, 182 and 228 of the Penal Code 1871, “public servant” is deemed to include a member of a Disciplinary Committee holding a formal inquiry, and in sections 193 and 228 of the Penal Code 1871, “judicial proceeding” is deemed to include such a formal inquiry.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 51. Procedure of Disciplinary Committe...",
    "content_length": 4022,
    "created_at": "2025-03-31T07:43:33.288127",
    "updated_at": "2025-03-31T07:44:00.856191",
    "file_path": "unknown_source"
  },
  "doc-e11fd5b4f97b2b04f7025be4fc680369": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 52. Cancellation of registration, suspension, etc., of public accountants\n        Section Content: 52\\. —(1)  If, at the conclusion of the formal inquiry, the Disciplinary Committee is satisfied that the public accountant —\n(a)\nhas been convicted in Singapore or elsewhere of any offence involving fraud or dishonesty or moral turpitude;\n(b)\nhas been convicted in Singapore or elsewhere of any offence implying a defect in character which makes him or her unfit for his or her profession;\n(c)\nhas been guilty of such improper or dishonourable conduct in the discharge of his or her professional duty or such improper or dishonourable conduct which, in the opinion of the Disciplinary Committee, renders him or her unfit to be a public accountant or would bring the profession of public accountancy into disrepute;\n(d)\nhas carried on by himself or herself or by any of his or her employees any trade, business or calling that detracts from the profession of public accountancy or is in any way incompatible with it, or is employed in any such trade, business or calling;\n(e)\nhas, while being a director of an accounting corporation or a partner of an accounting LLP, failed to take reasonable steps to prevent the accounting corporation or accounting LLP from acting in a manner which would warrant the Oversight Committee imposing any order on the accounting corporation or accounting LLP under section 53(2);\n(f)\nhas rendered public accountancy services as, or purporting to be —\n(i)\na director of a company which was not an accounting corporation; or\n(ii)\na partner of a limited liability partnership which was not an accounting LLP,\nwhen the services were rendered;\n(g)\nhas, while being a director of an accounting corporation or partner of an accounting LLP, practised public accountancy at such a time when the accounting corporation or accounting LLP was not covered by any professional indemnity insurance or was not so covered to the extent required by section 28; or\n(h)\nhas, while being a director of an accounting corporation, failed to comply with section 29(4),\nthe Disciplinary Committee must report its findings to the Oversight Committee and recommend to the Oversight Committee to take any of the actions referred to in subsection (2)(a) to (f).\n(2)  Upon receiving the report and recommendation of the Disciplinary Committee under subsection (1), the Oversight Committee may —\n(a)\nby order cancel the registration of the public accountant;\n(b)\nby order suspend the public accountant from practice for a period not exceeding 2 years as may be specified in the order;\n(c)\nby order impose such conditions as are necessary to restrict the practice of the public accountant in such manner as the Oversight Committee thinks fit for a period not exceeding 2 years;\n(d)\nby order impose on the public accountant a penalty not exceeding $10,000;\n(e)\nby writing censure the public accountant;\n(f)\nby order require the public accountant to give such undertaking as the Oversight Committee thinks fit; or\n(g)\nmake such other order as it thinks just and expedient in the circumstances of the case.\n(3)  In addition to its powers under subsection (2), the Oversight Committee may order the public accountant concerned to pay to the Authority such sums as it thinks fit in respect of costs and expenses of and incidental to any proceedings against him or her under this Part and the General Division of the High Court has jurisdiction to tax such costs and any such order for costs is enforceable as if it were ordered in connection with a civil action in the General Division of the High Court.\n(4)  Where a public accountant in respect of whom an order mentioned in subsection (2)(c), (d) or (f) has been made fails to comply with any of the requirements imposed on him or her by the order or breaches any undertaking given by him or her pursuant to such order, the Oversight Committee may order —\n(a)\nthat his or her name be removed from the Register of Public Accountants; or\n(b)\nthat he or she be suspended from practice for such period not exceeding 12 months as may be specified in the order.\n(5)  Where the Oversight Committee has made an order mentioned in subsection (2)(c), the Oversight Committee may, having regard to any change in circumstances, by another order revoke the original order or revoke or vary any of the conditions imposed by the original order.\n(6)  Where the Oversight Committee has, under subsection (5), varied the conditions imposed by an order mentioned in subsection (2)(c), the Registrar must immediately serve on the public accountant concerned a notice of the variation.\n(7)  Any penalty mentioned in subsection (2)(d) is recoverable as a debt due to the Authority from the public accountant concerned.\n(8)  A decision of the Oversight Committee under subsection (2), (3), (4) or (5) does not take effect —\n(a)\nuntil the expiry of one month from the date on which the decision has been communicated to the public accountant concerned; or\n(b)\nwhere an appeal against the decision is made to the General Division of the High Court under section 54, until the appeal has been determined or withdrawn.\n(9)  [\nDeleted by Act 32 of 2022 wef 01/07/2023\n]\n(10)  For the purposes of subsection (1)(e), a public accountant is deemed to have taken reasonable steps to prevent the doing of any act by any accounting corporation or accounting LLP if he or she satisfies the Disciplinary Committee that the act was done without his or her knowledge and that —\n(a)\nhe or she was not in a position to influence the conduct of the accounting corporation or accounting LLP in relation to its action; or\n(b)\nhe or she, being a director of the accounting corporation or a partner of the accounting LLP, exercised all due diligence to prevent the accounting corporation or accounting LLP from so acting.\n(11)  In this section, references to acts done by an accounting corporation or an accounting LLP include references to omissions and to a series of acts or omissions to act.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 52. Cancellation of registration, susp...",
    "content_length": 6058,
    "created_at": "2025-03-31T07:44:01.063907",
    "updated_at": "2025-03-31T07:45:00.828143",
    "file_path": "unknown_source"
  },
  "doc-9334c8020622d24e1520f71721fa39ae": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 53. Revocation of approval, etc., of accounting corporations, accounting firms and accounting LLPs\n        Section Content: 53\\. —(1)  If, at the conclusion of a formal inquiry, the Disciplinary Committee is satisfied that —\n(a)\nan accounting corporation or any of its directors, an accounting firm or any of the partners in the accounting firm, or an accounting LLP or any of the partners in the accounting LLP, has falsified or caused to be falsified any document, or has made or caused to be made any statement which is material and which the accounting corporation, accounting firm, accounting LLP, director or partner (as the case may be) knows is false or does not believe to be true in relation to any document;\n(b)\nan accounting corporation, accounting firm or accounting LLP has done or omitted to do something which, if done or omitted to be done by a public accountant, would be regarded as being improper or dishonourable conduct that would bring the profession of public accountancy into disrepute;\n(c)\nan accounting corporation, accounting firm or accounting LLP has carried on by itself or by any of its employees any trade, business or calling that detracts from the profession of public accountancy or is in any way incompatible with it, or is employed in any such trade, business or calling;\n(d)\nan accounting corporation, accounting firm or accounting LLP has rendered any public accountancy services under a name other than the name approved under section 19;\n(e)\nan accounting corporation or accounting LLP has provided public accountancy services without being covered by professional indemnity insurance at all or to the extent required by section 28; or\n(f)\nan accounting corporation has contravened or failed to comply with the requirements for accounting corporations in section 26, 27 or 29 or in any of the rules,\nthe Disciplinary Committee must report its findings to the Oversight Committee and recommend to the Oversight Committee to take any of the actions referred to in subsection (2)(a) to (f).\n(2)  Upon receiving the report and recommendation of the Disciplinary Committee under subsection (1), the Oversight Committee may —\n(a)\nby order revoke the approval granted to the accounting corporation, accounting firm or accounting LLP under Part 4;\n(b)\nby order suspend the accounting corporation, accounting firm or accounting LLP from providing public accountancy services for a period not exceeding 2 years as may be specified in the order;\n(c)\nby order impose such conditions as are necessary to restrict the provision of public accountancy services by the accounting corporation, accounting firm or accounting LLP in such manner as the Oversight Committee thinks fit for a period not exceeding 2 years;\n(d)\nby order impose on the accounting corporation, accounting firm or accounting LLP a penalty not exceeding $250,000;\n(e)\nby writing censure the accounting corporation, accounting firm or accounting LLP;\n(f)\nby order require the accounting corporation, accounting firm or accounting LLP to give such undertaking as the Disciplinary Committee thinks fit; or\n(g)\nmake any other order that it thinks just and expedient in the circumstances of the case.\n(3)  In addition to its powers under subsection (2), the Oversight Committee may order the accounting corporation, accounting firm or accounting LLP concerned to pay to the Authority such sums as it thinks fit in respect of costs and expenses of and incidental to any proceedings against the accounting corporation, accounting firm or accounting LLP under this Part and the General Division of the High Court has jurisdiction to tax such costs and any such order for costs is enforceable as if it were ordered in connection with a civil action in the General Division of the High Court.\n(4)  Where an accounting corporation, accounting firm or accounting LLP in respect of which an order mentioned in subsection (2)(c), (d) or (f) has been made fails to comply with any of the requirements imposed on it by the order or breaches any undertaking given by it pursuant to such order, the Oversight Committee may —\n(a)\nby order revoke the approval granted to the accounting corporation, accounting firm or accounting LLP under Part 4; or\n(b)\nby order suspend the accounting corporation, accounting firm or accounting LLP from providing public accountancy services for such period not exceeding 12 months as may be specified in the order.\n(5)  Where the Oversight Committee has made an order mentioned in subsection (2)(c), the Oversight Committee may, having regard to any change in circumstances, by another order revoke the original order or revoke or vary any of the conditions imposed by the original order.\n(6)  Where the Oversight Committee has, under subsection (5), varied the conditions imposed by an order mentioned in subsection (2)(c), the Registrar must immediately serve on the accounting corporation, accounting firm or accounting LLP concerned a notice of the variation.\n(7)  Any penalty mentioned in subsection (2)(d) is recoverable as a debt due to the Authority from the accounting corporation, accounting firm or accounting LLP concerned.\n(8)  A decision by the Oversight Committee under subsection (2), (3), (4) or (5) does not take effect —\n(a)\nuntil the expiry of one month from the date on which the decision has been communicated to the accounting corporation, accounting firm or accounting LLP concerned; or\n(b)\nwhere an appeal against the decision is made to the General Division of the High Court under section 54, until the appeal has been determined or withdrawn.\n(9)  [\nDeleted by Act 32 of 2022 wef 01/07/2023\n]",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 53. Revocation of approval, etc., of a...",
    "content_length": 5693,
    "created_at": "2025-03-31T07:45:01.066670",
    "updated_at": "2025-03-31T07:45:29.784058",
    "file_path": "unknown_source"
  },
  "doc-40a457131bc0d42de307746b42d12ca4": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 54. Appeal against disciplinary orders of Oversight Committee\n        Section Content: 54\\. —(1)  Any public accountant, accounting corporation, accounting firm or accounting LLP who or which is aggrieved with any decision made by the Oversight Committee under section 52 or 53 may appeal to the General Division of the High Court within a period of 30 days or within any further period that the General Division of the High Court may allow, after the service of the decision of the Oversight Committee on the public accountant, accounting corporation, accounting firm or accounting LLP, as the case may be.\n(2)  The decision of the General Division of the High Court on an appeal under subsection (1) is final.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 54. Appeal against disciplinary orders...",
    "content_length": 773,
    "created_at": "2025-03-31T07:45:30.009196",
    "updated_at": "2025-03-31T07:45:53.115670",
    "file_path": "unknown_source"
  },
  "doc-bc62bca916798033dc273ac28751c34b": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 55. Reinstatement to Register\n        Section Content: 55\\. —(1)  Where —\n(a)\nthe registration of a public accountant has been cancelled under Part 5, 5A or 6 and his or her name and particulars removed from the Register of Public Accountants; or\n(b)\nthe approval granted to an accounting corporation, accounting firm or accounting LLP under Part 4 is revoked under Part 5A or 6 and its name and particulars removed from the Register of Public Accounting Corporations, the Register of Public Accounting Firms or the Register of Public Accounting Limited Liability Partnerships,\nthe public accountant, accounting corporation, accounting firm or accounting LLP concerned must, if his, her or its appeal to the General Division of the High Court is allowed, be immediately reinstated to the Register of Public Accountants, the Register of Public Accounting Corporations, the Register of Public Accounting Firms or the Register of Public Accounting Limited Liability Partnerships (as the case may be) without payment of any fee.\n(2)  The Oversight Committee may, after the expiry of at least 2 years from the cancellation of the registration of any public accountant or the revocation of the approval granted under Part 4 to an accounting corporation, accounting firm or accounting LLP, consider any fresh application for registration or approval by such public accountant, accounting corporation, accounting firm or accounting LLP.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 55. Reinstatement to Register\n        ...",
    "content_length": 1490,
    "created_at": "2025-03-31T07:45:53.366350",
    "updated_at": "2025-03-31T07:46:29.996773",
    "file_path": "unknown_source"
  },
  "doc-ee3edd824f91f9462493b0056e70c292": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 56. Holding out as public accountant, accounting corporation, accounting firm or accounting LLP, etc.\n        Section Content: 56\\. —(1)  A person who is not registered as a public accountant under this Act must not —\n(a)\npractise as a public accountant;\n(b)\nhold himself or herself out to be a public accountant; or\n(c)\nuse in connection with his or her name or otherwise assume, use, or advertise any title or description tending to convey the impression that he or she is a public accountant registered under this Act, or that he or she is otherwise authorised to provide public accountancy services in Singapore.\n(1A)  A public accountant —\n(a)\nwhose registration is suspended under Part 5 or 5A; or\n(b)\nwho is suspended from practice under Part 6,\nmust not —\n(c)\npractise as a public accountant during the period of his or her suspension;\n(d)\nhold himself or herself out, in respect of the period for which he or she is suspended, to be a public accountant; or\n(e)\nadvertise any title or description tending to convey the impression that he or she is, in respect of the period for which he or she is suspended, a public accountant registered under this Act, or that he or she is authorised to provide public accountancy services in Singapore.\n(2)  Subject to subsection (4), a body corporate which is not approved as an accounting corporation under this Act must not —\n(a)\nprovide public accountancy services in Singapore;\n(b)\nadvertise or hold itself out or describe itself in any way to be an accounting corporation or to be authorised to provide public accountancy services in Singapore; or\n(c)\nuse in connection with its name, or with the name under which it carries on business, the words “Public Accounting Corporation”, or any abbreviation or derivative thereof, or use at the end of such name the acronym “PAC”, or any combination of such acronym, words, abbreviation or derivative.\n(2A)  An accounting corporation that is suspended from providing public accountancy services under Part 5A or 6, must not —\n(a)\nprovide public accountancy services in Singapore during the period of its suspension;\n(b)\nadvertise or hold itself out or describe itself in any way, in respect of the period for which it is suspended, to be an accounting corporation or to be authorised to provide public accountancy services in Singapore; or\n(c)\nuse in connection with its name or with the name under which it carries on business, in respect of the period for which it is suspended —\n(i)\nthe words “Public Accounting Corporation” or any abbreviation or derivative of those words;\n(ii)\nthe acronym “PAC” at the end of its name; or\n(iii)\nany combination of the following:\n(A)\nthe words mentioned in sub‑paragraph (i);\n(B)\nany abbreviation or derivative of the words mentioned in sub‑paragraph (i);\n(C)\nthe acronym mentioned in sub‑paragraph (ii).\n(3)  A partnership or any other unincorporated body which is not approved as an accounting firm under this Act must not —\n(a)\nprovide public accountancy services in Singapore; or\n(b)\nadvertise or hold itself out or describe itself in any way to be an accounting firm or to be authorised to provide public accountancy services in Singapore.\n(3A)  An accounting firm that is suspended from providing public accountancy services under Part 5A or 6, must not —\n(a)\nprovide public accountancy services in Singapore during the period of its suspension; or\n(b)\nadvertise or hold itself out or describe itself in any way, in respect of the period for which it is suspended, to be an accounting firm or to be authorised to provide public accountancy services in Singapore.\n(4)  A limited liability partnership which is not approved as an accounting LLP under this Act must not —\n(a)\nprovide public accountancy services in Singapore; or\n(b)\nadvertise or hold itself out or describe itself in any way to be an accounting LLP or to be authorised to provide public accountancy services in Singapore.\n(4A)  An accounting LLP that is suspended from providing public accountancy services under Part 5A or 6, must not —\n(a)\nprovide public accountancy services in Singapore during the period of its suspension; or\n(b)\nadvertise or hold itself out or describe itself in any way, in respect of the period for which it is suspended, to be an accounting LLP or to be authorised to provide public accountancy services in Singapore.\n(5)  The Authority may exempt any person from all or any of the provisions of subsection (1), (1A), (2), (2A), (3), (3A), (4) or (4A).\n(6)  Any person who contravenes subsection (1), (1A), (2), (2A), (3), (3A), (4) or (4A) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 12 months or to both and, in the case of a second or subsequent conviction, to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 56. Holding out as public accountant, ...",
    "content_length": 4941,
    "created_at": "2025-03-31T07:46:30.236593",
    "updated_at": "2025-03-31T07:47:21.027193",
    "file_path": "unknown_source"
  },
  "doc-81994fa20f013ac6776223c251c210ee": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 56A. Subsequent suspension orders\n        Section Content: 56A\\. —(1)  Where the Oversight Committee has made a suspension order (X) against a public accountant, an accounting corporation, an accounting firm or an accounting LLP, the period of suspension ordered under any suspension order made against that public accountant, accounting corporation, accounting firm or accounting LLP that is subsequent to\nX\nmust not, together with the period of suspension ordered under\nX\n, exceed a period of 2 years in aggregate.\n(2)  In this section, “suspension order” means —\n(a)\nin relation to a public accountant, an order of the Oversight Committee to —\n(i)\nsuspend the registration of a public accountant under Part 5 or 5A; or\n(ii)\nsuspend a public accountant from practice under Part 6; and\n(b)\nin relation to an accounting corporation, accounting firm or accounting LLP, an order of the Oversight Committee to suspend the accounting corporation, accounting firm or accounting LLP from providing public accounting services under Part 5A or 6.\n(3)  For the purposes of this section —\n(a)\nin relation to a suspension order made against a public accountant, a suspension order is subsequent to\nX\nif —\n(i)\nthe suspension order was made after\nX\nbut before the period of suspension ordered under\nX\nhad expired; and\n(ii)\nwhere 2 or more suspension orders were made after\nX\n, each such suspension order was made before the period of suspension ordered under the suspension order preceding it had expired; and\n(b)\nin relation to a suspension order made against an accounting corporation, accounting firm or accounting LLP, a suspension order is subsequent to\nX\nif —\n(i)\nthe suspension order was made after\nX\nbut before the period of suspension ordered under\nX\nhad expired; and\n(ii)\nwhere 2 or more suspension orders were made after\nX\n, each such suspension order was made before the period of suspension ordered under the suspension order preceding it had expired.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 56A. Subsequent suspension orders\n    ...",
    "content_length": 2013,
    "created_at": "2025-03-31T07:47:21.282199",
    "updated_at": "2025-03-31T07:47:43.259275",
    "file_path": "unknown_source"
  },
  "doc-05f7065c5e60ae1ace6f7f5c2f0a99a0": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 57. Remuneration for services rendered\n        Section Content: 57\\. —(1)  Subject to this Act, a person is not entitled to recover any expenses or remuneration for or in respect of any public accountancy services rendered or provided unless the person rendering or providing such services is —\n(a)\na public accountant;\n(b)\nan accounting corporation;\n(c)\nan accounting firm; or\n(d)\nan accounting LLP.\n(2)  Subsection (1) does not apply to —\n(a)\nthe Auditor-General or any public officer authorised by him or her; or\n(b)\nany public officer or any officer of any statutory authority authorised by the Minister in the exercise of their powers or in the performance of their official duties.\n(3)  Any person who contravenes subsection (1) shall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 12 months or to both and, in the case of a second or subsequent conviction, to a fine not exceeding $10,000 or to imprisonment for a term not exceeding 2 years or to both.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 57. Remuneration for services rendered...",
    "content_length": 1107,
    "created_at": "2025-03-31T07:47:43.502693",
    "updated_at": "2025-03-31T07:48:12.332524",
    "file_path": "unknown_source"
  },
  "doc-f085956f9bcd614195024d962c6f58bb": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 58. Fraudulent practices in relation to registration\n        Section Content: 58\\. Any person who —\n(a)\nprocures or attempts to procure —\n(i)\napproval as an accounting corporation, accounting firm or accounting LLP under this Act; or\n(ii)\nregistration or a certificate of registration as a public accountant under this Act,\nby knowingly making or producing or causing to be made any false or fraudulent declaration, certificate, application or representation, whether in writing or otherwise;\n(b)\nwilfully makes or causes to be made any falsification in the Register of Public Accountants, the Register of Public Accounting Corporations, the Register of Public Accounting Firms or the Register of Public Accounting Limited Liability Partnerships;\n(c)\nforges, alters or counterfeits any certificate of registration as a public accountant issued under this Act;\n(d)\nuses any forged, altered or counterfeit certificate of registration as a public accountant under this Act knowing the certificate to have been forged, altered or counterfeited; or\n(e)\npersonates or falsely represents himself or herself to be a public accountant or buys, sells or fraudulently obtains a certificate of registration as a public accountant issued under this Act,\nshall be guilty of an offence and shall be liable on conviction to a fine not exceeding $5,000 or to imprisonment for a term not exceeding 6 months or to both.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 58. Fraudulent practices in relation t...",
    "content_length": 1462,
    "created_at": "2025-03-31T07:48:12.597567",
    "updated_at": "2025-03-31T07:48:43.238213",
    "file_path": "unknown_source"
  },
  "doc-c464c0b29bb6e98ee304f336fa618bba": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 59. Restrictions on employing disqualified persons\n        Section Content: 59\\. —(1)  A public accountant must not in connection with his or her practice as such, and an accounting corporation, accounting firm or accounting LLP must not in connection with its business of providing public accountancy services, without the consent of the Oversight Committee, employ or remunerate any person who to his or her or its knowledge —\n(a)\nis an undischarged bankrupt;\n(b)\nhas had his or her registration as a public accountant suspended or cancelled under Part 5, 5A or 6; or\n(c)\nhas been convicted of an offence by a court of law and sentenced to imprisonment for a term of not less than 12 months or to a fine of not less than $5,000.\n(2)  On application made by any person, the Oversight Committee may make an order directing that, as from the date to be specified in the order, a public accountant must not in connection with his or her practice as such, or an accounting corporation, accounting firm or accounting LLP must not in connection with its provision of public accountancy services, (as the case may be) employ or remunerate any person, the subject of the application, who —\n(a)\nhas been a party to any act or default of a public accountant in respect of which a complaint has been or might properly have been made against that public accountant under the provisions of this Act; or\n(b)\nhas so conducted himself or herself while employed by a public accountant that, had he or she been a public accountant, his or her conduct might have formed the subject of a complaint under the provisions of this Act against him or her.\n(3)  Every application under subsection (2) must be served on the person in respect of whom it is made and on his or her employer or previous employer if his or her employer or previous employer is a public accountant, an accounting corporation, an accounting firm or an accounting LLP, at least 10 days before the application is to be heard.\n(4)  Every order made under subsection (2) must be filed in a file kept for this purpose by the Registrar and the file may be inspected by any public accountant, accounting corporation, accounting firm or accounting LLP without fee.\n(5)  Disciplinary proceedings may be taken against any public accountant, accounting corporation, accounting firm or accounting LLP who or which contravenes subsection (1) or fails to comply with an order made under subsection (2).",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 59. Restrictions on employing disquali...",
    "content_length": 2501,
    "created_at": "2025-03-31T07:48:43.518400",
    "updated_at": "2025-03-31T07:49:12.840852",
    "file_path": "unknown_source"
  },
  "doc-180785796921b349510f949f2df5f25e": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 6. Appointment of sub-committees by Oversight Committee\n        Section Content: 6\\. —(1)  Subject to any general or special direction of the Authority, the Oversight Committee may appoint one or more sub‑committees for any general or special purpose which in the opinion of the Oversight Committee may be better dealt with or managed by a sub‑committee.\n(2)  The Oversight Committee may delegate to any sub‑committee appointed under subsection (1), with or without restrictions or conditions as it thinks fit, any of the powers or functions which may be exercised or performed by the Oversight Committee under this Act.\n(3)  The number and term of office of the members of any sub‑committee appointed under this section and the number of those members necessary to form a quorum is to be determined by the Oversight Committee.\n(4)  A sub-committee appointed under this section may include persons who are not members of the Oversight Committee.\n(5)  The Oversight Committee may continue to exercise any power conferred upon it or perform any function under this Act despite the delegation of such power or function to a sub‑committee under this section.\n(6)  For the purposes of the Accounting and Corporate Regulatory Authority Act 2004, any member of a sub‑committee appointed by the Oversight Committee under or for the purposes of this Act is deemed to be a member of a committee of the Authority.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 6. Appointment of sub-committees by Ov...",
    "content_length": 1464,
    "created_at": "2025-03-31T07:49:13.099479",
    "updated_at": "2025-03-31T07:49:28.797132",
    "file_path": "unknown_source"
  },
  "doc-3555ca621f6fa9eebe122351d10146f5": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 60. Offences committed by bodies corporate, etc.\n        Section Content: 60\\. —(1)  Where an offence under this Act which has been committed by a body corporate is proved to have been committed with the consent or connivance of, or to be attributable to any neglect on the part of, a director, partner, manager, secretary or any similar officer of the body corporate, or any person who was purporting to act in any such capacity, he, she or it, as well as the body corporate, shall be guilty of that offence and shall be liable to be proceeded against and punished accordingly.\n(2)  Where the affairs of a body corporate are managed by its members, subsection (1) applies in relation to the acts and defaults of a member in connection with the member’s functions of management as if the member were a director of the body corporate.\n(3)  Proceedings for an offence under this Act alleged to have been committed by a partnership must be brought in the name of the partnership and not in that of the partners; but without prejudice to any liability of the partners under subsection (5).\n(4)  A fine imposed on a partnership on its conviction in such proceedings must be paid out of the partnership assets.\n(5)  Where a partnership is guilty of an offence under this Act, every partner, other than a partner who is proved to have been ignorant of or to have attempted to prevent the commission of the offence, shall also be guilty of the offence and shall be liable to be proceeded against and punished accordingly.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 60. Offences committed by bodies corpo...",
    "content_length": 1575,
    "created_at": "2025-03-31T07:49:29.050858",
    "updated_at": "2025-03-31T07:49:48.500820",
    "file_path": "unknown_source"
  },
  "doc-325b1c0940efc2a5606a81b277710a3e": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 61. Jurisdiction of District Court\n        Section Content: 61\\. Despite any provision to the contrary in the Criminal Procedure Code 2010, a District Court has jurisdiction to try any offence under this Act and has power to impose the full penalty or punishment in respect of the offence.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 61. Jurisdiction of District Court\n   ...",
    "content_length": 351,
    "created_at": "2025-03-31T07:49:48.761771",
    "updated_at": "2025-03-31T07:50:02.907807",
    "file_path": "unknown_source"
  },
  "doc-c41bc36b5d1d849fc7c024b11bbdc4f6": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 62. Composition of offences\n        Section Content: 62\\. —(1)  The Oversight Committee or any officer of the Authority who is authorised by the Oversight Committee in that behalf may compound any offence under this Act which is prescribed as a compoundable offence by collecting from a person reasonably suspected of having committed the offence a sum of money not exceeding $1,000.\n(2)  On payment of the sum of money, no further proceedings are to be taken against such person in respect of the offence.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 62. Composition of offences\n        Se...",
    "content_length": 568,
    "created_at": "2025-03-31T07:50:03.175461",
    "updated_at": "2025-03-31T07:50:17.409093",
    "file_path": "unknown_source"
  },
  "doc-0058b0a4f278e480d728e1a63829329d": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 63. Protection from personal liability\n        Section Content: 63\\. No suit or other legal proceedings shall lie personally against any person who is a member of a Complaints Committee or a Disciplinary Committee for anything which is in good faith done or intended to be done in the execution or purported execution of this Act.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 63. Protection from personal liability...",
    "content_length": 392,
    "created_at": "2025-03-31T07:50:17.672051",
    "updated_at": "2025-03-31T07:50:33.012594",
    "file_path": "unknown_source"
  },
  "doc-8de19c37ca8fdf85aa679b86ef536d41": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 64. Rules\n        Section Content: 64\\. —(1)  The Authority may, with the approval of the Minister, make rules to give effect to this Act.\n(2)  Without limiting subsection (1), the Authority may, with the approval of the Minister, make rules —\n(a)\nto provide for the manner in which applications for registration or approval may be made under this Act;\n(b)\nto prescribe the fees payable for the purposes of this Act;\n(c)\nto prescribe the penalties payable for the late lodgment of any document;\n(d)\nfor or with respect to the waiver, refund or remission, whether wholly or in part, of any fee or penalty payable under this Act;\n(e)\nto prescribe the qualifications and other requirements for the registration of public accountants under this Act;\n(f)\nto provide for the classification of public accountants;\n(g)\nto prescribe the requirements to be applied by public accountants, accounting corporations, accounting firms and accounting LLPs in relation to —\n(i)\nthe detection and prevention of money laundering or the financing of terrorism; and\n(ii)\nthe recording and reporting of transactions suspected of involving money laundering or the financing of terrorism,\nincluding any requirement necessary or expedient to give effect to any recommendation issued or adopted by the intergovernmental body known as the Financial Action Task Force relating to the prevention of money laundering and the financing of terrorism;\n(h)\nto prescribe the requirements in respect of professional conduct and ethics applicable to public accountants, accounting corporations, accounting firms and accounting LLPs when providing public accountancy services, other than the matters assigned to the Oversight Committee by the Authority and set out in the code of professional conduct and ethics prescribed by order under section 64AA(1)(a);\n(ha)\nto prescribe the standards, methods, procedures and other requirements to be applied by public accountants, accounting corporations, accounting firms and accounting LLPs when providing public accountancy services, other than any standard, method, procedure or requirement which is of a class or description specified in the Second Schedule;\n(i)\nto provide for matters relating to the discipline of public accountants, accounting corporations, accounting firms and accounting LLPs;\n(ia)\nto provide for the publication of any decision or order of the Oversight Committee made under section 38, 38H, 38I, 38J, 52 or 53;\n(j)\nto impose restrictions on persons or classes of persons who may become officers of an accounting corporation, accounting firm or accounting LLP;\n(k)\nto provide for the exemption of any persons or classes of persons from any provision of Part 3 or 4; and\n(l)\nto prescribe anything which may be prescribed or is required to be prescribed under this Act.\n(3)  In making rules for the purposes of subsection (2)(g), (h) and (ha), the Authority may adopt by reference (whether wholly or in part, and with or without modification) the following (called in this section the external material):\n(a)\nin the case of rules made for the purposes of subsection (2)(g) — any requirements issued or applied by any professional accountancy body or organisation, whether in Singapore or elsewhere (as in force at a particular time or from time to time) to give effect to any recommendation issued or adopted by the intergovernmental body known as the Financial Action Task Force relating to the prevention of money laundering and the financing of terrorism;\n(b)\nin the case of rules made for the purposes of subsection (2)(h) — any requirements in respect of professional conduct and ethics issued or applied by any professional accountancy body or organisation, whether in Singapore or elsewhere (as in force at a particular time or from time to time);\n(c)\nin the case of rules made for the purposes of subsection (2)(ha) — any standard, method, procedure or other requirement issued or applied by any professional accountancy body or organisation, whether in Singapore or elsewhere (as in force at a particular time or from time to time).\n(4)  Any external material adopted by reference in any rules made for the purposes of subsection (2)(g), (h) or (ha) is to be treated as forming part of the rules.\n(5)  Unless otherwise provided in the rules, where any external material is adopted by reference as in force from time to time, every amendment to the external material that is made by the professional accountancy body or organisation that issued or applied the material is to be treated as forming part of the rules.\n(6)  Where any external material is adopted by reference in any rules made for the purposes of subsection (2)(g), (h) or (ha), the Authority must give notice in the\nGazette\nstating —\n(a)\nthat the external material is adopted by reference and the date on which the external material is adopted by reference;\n(b)\nthat the external material is available for inspection during normal office hours, free of charge, and the place at which the external material may be inspected;\n(c)\nthe details of where and how the external material can be obtained, free of charge; and\n(d)\nif copies of the external material are available in other ways, the details of where and how the copies can be accessed or obtained.\n(7)  Where any external material adopted by reference in any rules made for the purposes of subsection (2)(g), (h) or (ha) is amended, the Authority must give notice in the\nGazette\nstating —\n(a)\nthat there has been an amendment to the external material and the date of the amendment;\n(b)\nthat the external material as amended is available for inspection during normal office hours, free of charge, and the place at which the external material as amended can be inspected;\n(c)\nthe details of where and how the external material as amended can be obtained, free of charge; and\n(d)\nif copies of the external material as amended are available in other ways, the details of where and how the copies can be accessed or obtained.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 64. Rules\n        Section Content: 64\\...",
    "content_length": 6038,
    "created_at": "2025-03-31T07:50:33.301198",
    "updated_at": "2025-03-31T07:51:08.744350",
    "file_path": "unknown_source"
  },
  "doc-6356ed7498599c94b03635d99ed83139": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 64A. Amendment of Schedules\n        Section Content: 64AB.\nThe Authority may, with the approval of the Minister, by order in the\nGazette\n, amend or vary the First or Second Schedule.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 64A. Amendment of Schedules\n        Se...",
    "content_length": 244,
    "created_at": "2025-03-31T07:51:09.016212",
    "updated_at": "2025-03-31T07:51:22.288806",
    "file_path": "unknown_source"
  },
  "doc-09b43863b3a57c9a2bdb546d9603fd1e": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 64A. Orders for code of professional conduct and ethics, standards, etc., prescribed by Oversight Committee\n        Section Content: 64AA.\n—(1)  The Oversight Committee may, by order in the\nGazette\n, prescribe —\n(a)\nthe code of professional conduct and ethics applicable to public accountants, accounting corporations, accounting firms and accounting LLPs; and\n(b)\nany standard, method, procedure or other requirement which is of a class or description specified in the Second Schedule that is to be applied by public accountants, accounting corporations, accounting firms and accounting LLPs when providing public accountancy services.\n(2)  For the purposes of subsection (1), the Oversight Committee may adopt by reference (whether wholly or in part, and with or without modification) —\n(a)\nany code of professional conduct and ethics or any provision of any code of professional conduct and ethics; or\n(b)\nany standard, method, procedure or other requirement,\n(as the case may be) issued or applied by any professional accountancy body or organisation, whether in Singapore or elsewhere as in force at a particular time or from time to time (called in this section the external material).\n(3)  Any external material adopted by reference in an order under subsection (1) is to be treated as forming part of the order.\n(4)  Unless otherwise provided in the order, where any external material is adopted by reference as in force from time to time, every amendment to the external material that is made by the professional accountancy body or organisation that issued or applied the external material is to be treated as forming part of the order.\n(5)  Where any external material is adopted by reference in an order under subsection (1), the Oversight Committee must give notice in the\nGazette\nstating —\n(a)\nthat the external material is adopted by reference and the date on which the external material is adopted by reference;\n(b)\nthat the external material is available for inspection during normal office hours, free of charge, and the place at which the external material may be inspected;\n(c)\nthe details of where and how the external material can be obtained, free of charge; and\n(d)\nif copies of the external material are available in other ways, the details of where and how the copies can be accessed or obtained.\n(6)  Where any external material adopted by reference in an order under subsection (1) is amended, the Oversight Committee must give notice in the\nGazette\nstating —\n(a)\nthat there has been an amendment to the external material and the date of the amendment;\n(b)\nthat the external material as amended is available for inspection during normal office hours, free of charge, and the place at which the external material as amended can be inspected;\n(c)\nthe details of where and how the external material as amended can be obtained, free of charge; and\n(d)\nif copies of the external material as amended are available in other ways, the details of where and how the copies can be accessed or obtained.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 64A. Orders for code of professional c...",
    "content_length": 3081,
    "created_at": "2025-03-31T07:51:22.575149",
    "updated_at": "2025-03-31T07:51:52.429423",
    "file_path": "unknown_source"
  },
  "doc-6ee4d5618fe1b6d234dd5b729fa82e29": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 64A. Service of documents on public accountant\n        Section Content: 64A\\. Any document required to be served under this Act on a public accountant is sufficiently served if addressed to the public accountant and left at or sent by post to his or her residential address or contact address.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 64A. Service of documents on public ac...",
    "content_length": 355,
    "created_at": "2025-03-31T07:51:52.733308",
    "updated_at": "2025-03-31T07:52:04.905844",
    "file_path": "unknown_source"
  },
  "doc-abe321df97dc15bc07a8a9aaa671c24e": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 65. Saving for repealed Accountants Act\n        Section Content: 65\\. —(1)  All acts done before 1 April 2004 by the Public Accountants Board established under Part II of the repealed Accountants Act continue to remain valid and applicable as though done by the Authority or the Oversight Committee, until such time as invalidated, revoked, cancelled or otherwise determined by the Authority or the Oversight Committee.\n(2)  Any notice, order or direction issued or made before 1 April 2004 under the repealed Accountants Act is deemed to be a notice, an order or a direction issued or made under this Act.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 65. Saving for repealed Accountants Ac...",
    "content_length": 668,
    "created_at": "2025-03-31T07:52:05.199455",
    "updated_at": "2025-03-31T07:52:20.526585",
    "file_path": "unknown_source"
  },
  "doc-e59b91c1497e768841d07870cca6a648": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 66. Saving and transitional provisions for public accountants, accounting corporations and accounting firms\n        Section Content: 66\\. —(1)  Every individual who, immediately before 1 April 2004, was a registered public accountant under the repealed Accountants Act is deemed to be a registered public accountant under this Act.\n(2)  Every company which, immediately before 1 April 2004, was an approved accounting corporation under the repealed Accountants Act is deemed to be an approved accounting corporation under this Act.\n(3)  Every firm which, immediately before 1 April 2004, was providing public accountancy services under a name approved by the Public Accountants Board under the rules made under the repealed Accountants Act is deemed to be an approved accounting firm under this Act.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 66. Saving and transitional provisions...",
    "content_length": 861,
    "created_at": "2025-03-31T07:52:20.857601",
    "updated_at": "2025-03-31T07:52:38.778297",
    "file_path": "unknown_source"
  },
  "doc-2583d6f4fcfdcc739cafb0d6061fe827": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 67. Saving for other written laws\n        Section Content: 67\\. Insofar as it is necessary for preserving the effect of any written law or document —\n(a)\nany reference in the written law or document to the repealed Accountants Act is to be construed as a reference to this Act; and\n(b)\nany reference in the written law or document to a registered public accountant or an approved accounting corporation is to be construed as a reference to a public accountant registered under this Act or an accounting corporation approved under this Act.\n[69",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 67. Saving for other written laws\n    ...",
    "content_length": 605,
    "created_at": "2025-03-31T07:52:39.062943",
    "updated_at": "2025-03-31T07:52:53.073736",
    "file_path": "unknown_source"
  },
  "doc-012debf3ab973b72aa0743f80355d012": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 68. Transitional provisions relating to Institute of Certified Public Accountants of Singapore\n        Section Content: 68\\. —(1)  As from 1 April 2004 —\n(a)\nall movable and immovable property vested in the Institute of Certified Public Accountants of Singapore (hereinafter called the Institute) immediately before that date and all assets, interests, rights, privileges, liabilities and obligations of the Institute are transferred to and vest in its successor company without any further assurance, act or deed;\n(b)\nall individuals employed immediately before that date by the Institute are transferred to the service of its successor company on terms no less favourable than those enjoyed by them immediately prior to their transfer;\n(c)\nall deeds, contracts, schemes, bonds, agreements, instruments and arrangements subsisting immediately before that date to which the Institute is a party continue in force and are enforceable by or against its successor company as if the successor company had been named therein or had been a party thereto instead of the Institute; and\n(d)\nall persons who, immediately before that date, were members of the Institute become professional members of its successor society, in accordance with such classes of professional membership as may be determined by the successor society.\n(2)  In this section —\n“Institute of Certified Public Accountants of Singapore” means the former Institute of Certified Public Accountants of Singapore established under Part VI of the repealed Accountants Act;\n“successor company”, in relation to the Institute of Certified Public Accountants of Singapore, means the company incorporated by the successor society of the Institute under the Companies Act 1967 and designated by the Minister, by notification in the\nGazette\n, to be the successor company of the Institute for the purposes of subsection (1)(a), (b) and (c);\n“successor society”, in relation to the Institute of Certified Public Accountants of Singapore, means the society registered under the Societies Act 1966 that is designated by the Minister, by notification in the\nGazette\n, to be the society succeeding to the functions of the Institute as a professional accountancy body.\n[70",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 68. Transitional provisions relating t...",
    "content_length": 2277,
    "created_at": "2025-03-31T07:52:53.363377",
    "updated_at": "2025-03-31T07:53:29.219086",
    "file_path": "unknown_source"
  },
  "doc-e09fb39cffa41e95a5d42d72927236b0": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 7. Appointment and duties of Registrar\n        Section Content: 7\\. —(1)  The Authority must, from among its officers, appoint —\n(a)\na Registrar of Public Accountants; and\n(b)\nsuch number of Deputy Registrars and Assistant Registrars of Public Accountants as the Authority considers necessary.\n(2)  The Registrar must —\n(a)\ncarry out the functions and duties and exercise the powers conferred on him or her by this Act in accordance with any general or special directions that the Authority or the Oversight Committee may give to him or her;\n(b)\nattend all meetings of the Oversight Committee and record the proceedings of those meetings;\n(c)\nconduct the correspondence and deal with such matters as may be assigned to him or her by the Authority or the Oversight Committee;\n(d)\nissue all certificates and notices required to be issued under this Act; and\n(e)\ncollect all fees payable under this Act and pay all amounts so collected into the funds of the Authority.\n(3)  Subject to such restrictions and limitations as the Authority or Oversight Committee may determine, the powers and duties of the Registrar under this Act may be exercised and discharged by a Deputy Registrar or an Assistant Registrar.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 7. Appointment and duties of Registrar...",
    "content_length": 1267,
    "created_at": "2025-03-31T07:53:29.514949",
    "updated_at": "2025-03-31T07:53:48.480180",
    "file_path": "unknown_source"
  },
  "doc-2a41959e0a30141b7d1d7a0e51690e63": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 8. Registers\n        Section Content: 8\\. —(1)  The Registrar is responsible for the custody and maintenance of —\n(a)\nthe Register of Public Accountants;\n(b)\nthe Register of Public Accounting Corporations;\n(c)\nthe Register of Public Accounting Firms; and\n(d)\nthe Register of Public Accounting Limited Liability Partnerships.\n(2)  The Registrar must —\n(a)\nrecord —\n(i)\nin the Register of Public Accountants the name and relevant particulars of every public accountant who is registered under this Act or whose registration has been suspended or cancelled;\n(ii)\nin the Register of Public Accounting Corporations the name and relevant particulars of every accounting corporation that is approved under this Act or that has had its approval revoked;\n(iii)\nin the Register of Public Accounting Firms the name and relevant particulars of every accounting firm that is approved under this Act or that has had its approval revoked; and\n(iv)\nin the Register of Public Accounting Limited Liability Partnerships the name and relevant particulars of every accounting LLP that is approved under this Act or that has had its approval revoked;\n(b)\nallow any person to inspect the Register of Public Accountants, the Register of Public Accounting Corporations, the Register of Public Accounting Firms or the Register of Public Accounting Limited Liability Partnerships in such manner and on such terms as the Oversight Committee may determine;\n(c)\ninsert in the appropriate register any change in the names or relevant particulars recorded therein that may have been notified to him or her or that may otherwise have come to his or her knowledge; and\n(d)\ncorrect any error in any entry in any of the registers.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 8. Registers\n        Section Content: ...",
    "content_length": 1756,
    "created_at": "2025-03-31T07:53:48.783346",
    "updated_at": "2025-03-31T07:54:07.705308",
    "file_path": "unknown_source"
  },
  "doc-a3eda67635cc5c8ecdcb0c7d8dedbff6": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 8A. Transitional provision for contact address\n        Section Content: 8A\\. —(1)  Where an individual maintained an alternate address with the Registrar under this Act immediately before the commencement date, as from that date, the Registrar must cause —\n(a)\nthe alternate address to be kept as the individual’s contact address in a register maintained under section 8(1), instead of as the individual’s alternate address, until notice of a change in the individual’s contact address is lodged under any ACRA administered Act on or after that date; and\n(b)\nthe contact address to be made available for public inspection under section 8(2)(b) as the individual’s address.\n(2)  Where an individual did not maintain an alternate address with the Registrar under this Act immediately before the commencement date, but the individual’s residential address is kept in a register maintained under section 8(1), the Registrar must, as from that date, cause —\n(a)\nthe individual’s residential address to be kept as the individual’s contact address in that register, in addition to being kept as the individual’s residential address, until notice of a change in the individual’s contact address is lodged under any ACRA administered Act on or after that date; and\n(b)\nthe contact address to be made available for public inspection under section 8(2)(b) as the individual’s address.\n(3)  Where —\n(a)\nbefore the commencement date, the residential address of an individual practitioner of an accounting corporation, an accounting firm or an accounting LLP, a director of an accounting corporation, a partner of an accounting firm or a partner or manager of an accounting LLP (called in this subsection the individual) has been entered in a register mentioned in section 8(1) of that accounting corporation, accounting firm or accounting LLP, as the case may be; and\n(b)\non the commencement date, the registers mentioned in section 8(1) of that accounting corporation, accounting firm or accounting LLP (as the case may be) do not show that the individual holds any of the positions mentioned in paragraph (a) in the same accounting corporation, accounting firm or accounting LLP, as the case may be,\nthe Registrar must, as from the commencement date, cause the individual’s residential address to be excluded from public inspection of that register of that accounting corporation, accounting firm or accounting LLP (as the case may be) under section 8(2)(b).\n(4)  In this section —\n“commencement date” means the date of commencement of section 14 of the ACRA (Registry and Regulatory Enhancements) Act 2024;\n“individual practitioner” has the meaning given by section 38B.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 8A. Transitional provision for contact...",
    "content_length": 2722,
    "created_at": "2025-03-31T07:54:08.002460",
    "updated_at": "2025-03-31T07:54:45.094339",
    "file_path": "unknown_source"
  },
  "doc-5d26411870fda3fa06f4fc4538798108": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 8B. Exclusion of residential address from public inspection if contact address is available\n        Section Content: 8B\\. —(1)  The Registrar must cause an individual’s residential address recorded in any register maintained under section 8(1) to be excluded from public inspection under section 8(2)(b).\n(2)  Where, pursuant to subsection (1) or (3), the individual’s residential address is excluded from public inspection under section 8(2)(b), the Registrar may cause the residential address to cease to be excluded from such public inspection in accordance with section 8C.\n(3)  Where, pursuant to subsection (2), the individual’s residential address has ceased to be excluded from public inspection under section 8(2)(b), the Registrar must cause the exclusion from public inspection to resume if —\n(a)\nsubject to section 8C(8) and the equivalent provisions in other ACRA administered Acts, the Registrar receives notice of the individual’s contact address under any ACRA administered Act; or\n(b)\nthe Court so directs on an appeal under section 8C(7).",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 8B. Exclusion of residential address f...",
    "content_length": 1118,
    "created_at": "2025-03-31T07:54:45.394287",
    "updated_at": "2025-03-31T07:55:06.639379",
    "file_path": "unknown_source"
  },
  "doc-e5dc3db5cb8df9427d46832e509c17bf": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 8C. Cessation of exclusion of residential address from public inspection\n        Section Content: 8C\\. —(1)  For the purposes of section 8B(2), the grounds for causing an individual’s residential address to cease to be excluded from public inspection under section 8(2)(b) are either that —\n(a)\ncommunications sent by the Registrar under this Act, or any officer of the Authority under any ACRA administered Act, to the individual at his or her contact address and requiring a response within a specified period remain unanswered; or\n(b)\nthere is evidence to show that service of any document under this Act or under any ACRA administered Act at the individual’s contact address is not effective to bring it to the notice of the individual.\n(2)  Before causing the individual’s residential address to cease to be excluded from public inspection pursuant to section 8B(2), the Registrar must give a notice under subsection (3) to —\n(a)\nthe individual; and\n(b)\nevery accounting LLP or accounting corporation in respect of which the individual’s residential address had been recorded in any register maintained under section 8(1).\n(3)  The notice mentioned in subsection (2) must —\n(a)\nstate the grounds under subsection (1) on which the Registrar intends to cease the exclusion of the individual’s residential address; and\n(b)\nspecify the period within which representations may be made to the Registrar.\n(4)  The Registrar must consider the representations (if any) given in response to the notice mentioned in subsection (2) and received within the period specified by the Registrar under subsection (3)(b).\n(5)  If the Registrar decides to cause the individual’s residential address to cease being excluded from public inspection, the Registrar must before doing so give notice of the decision to —\n(a)\nthe individual; and\n(b)\nevery accounting LLP or accounting corporation in respect of which the individual’s residential address had been recorded in any register maintained under section 8(1).\n(6)  A notice to the individual under subsection (2) or (5) must be sent to the individual’s residential address unless it appears to the Registrar that service at that address may be ineffective to bring it to the individual’s notice, in which case it may be sent to any other last known address of that individual.\n(7)  Any person aggrieved by the decision of the Registrar under section 8B(2) may, within 30 days after the date of receiving the notice under subsection (5), appeal to the Court which may confirm or reverse the Registrar’s decision and make any directions in the matter.\n(8)  The individual is not allowed to provide a contact address within 3 years after the Registrar causes the individual’s residential address to cease to be excluded from public inspection under section 8(2)(b) pursuant to section 8B(2), unless the Registrar is satisfied that there is good cause for allowing the individual to do so in a particular case.\n(9)  Subject to subsection (8), where notice of a change in the individual’s contact address is lodged under any ACRA administered Act, the Registrar must replace the individual’s contact address in each register maintained under section 8(1) with the new contact address.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 8C. Cessation of exclusion of resident...",
    "content_length": 3278,
    "created_at": "2025-03-31T07:55:06.947097",
    "updated_at": "2025-03-31T07:55:30.396202",
    "file_path": "unknown_source"
  },
  "doc-86d4618a99540dcf39917868e40f5982": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 9. Certificate of Registrar\n        Section Content: 9\\. Where any question arises as to whether or not —\n(a)\nan individual is or was a public accountant registered under this Act;\n(b)\na company is or was an accounting corporation approved under this Act;\n(c)\na firm is or was an accounting firm approved under this Act;\n(d)\na limited liability partnership is or was an accounting LLP approved under this Act; or\n(e)\nan entry in any register kept under this Act is accurate or correct,\na certificate issued by the Registrar addressing such question is admissible as evidence in any proceedings and is prima facie evidence of the facts stated in the certificate.",
    "content_summary": "Act Name: ACCOUNTANTS ACT 2004\n        Section Title: Section 9. Certificate of Registrar\n        Se...",
    "content_length": 723,
    "created_at": "2025-03-31T07:55:30.705244",
    "updated_at": "2025-03-31T07:55:47.722237",
    "file_path": "unknown_source"
  }
}